// eslint-disable-next-line no-restricted-imports
import styles from "../contract-offer/contract-offer.module.scss";
import {
  Subheading,
  Subsubheading,
} from "@pages/contract-offer/contract-offer";

function PrivacyPolicy() {
  return (
    <section className={styles.container}>
      <h3 className={styles.heading}>Политика конфиденциальности </h3>
      <div className={styles.dash}></div>
      <Subheading text="Политика конфиденциальности " />
      <Subsubheading text="1. Основные понятия" />
      <p className={styles.text}>
        Сайт – личный сайт, расположенный в сети Интернет по адресу:
        https://golda-group.com/.
      </p>
      <p className={styles.text}>Администрация Сайта – ФОП.</p>
      <p className={styles.text}>
        Пользователь – физическое или юридическое лицо, разместившее свою
        персональную информацию посредством Формы обратной связи на сайте с
        последующей целью передачи данных Администрации Сайта.
      </p>
      <p className={styles.text}>
        Форма обратной связи – специальная форма, где Пользователь размещает
        свою персональную информацию с целью передачи данных Администрации
        Сайта.
      </p>
      <Subsubheading text="2. ОБЩИЕ ПОЛОЖЕНИЯ" />
      <p className={styles.text}>
        2.1. Настоящая Политика конфиденциальности является официальным типовым
        документом Администрации Сайта и определяет порядок обработки и защиты
        информации о физических и юридических лицах, использующих Форму обратной
        связи на Сайте.
      </p>
      <p className={styles.text}>
        2.2. Целью настоящей Политики конфиденциальности является обеспечение
        надлежащей защиты информации о Пользователе, в т.ч. его персональных
        данных от несанкционированного доступа и разглашения.
      </p>
      <p className={styles.text}>
        2.3. Отношения, связанные со сбором, хранением, распространением и
        защитой информации о пользователях регулируются настоящей Политикой
        конфиденциальности и действующим законодательством Российской Федерации.
      </p>
      <p className={styles.text}>
        2.4. Действующая редакция Политики конфиденциальности, является
        публичным документом, разработана Администрацией Сайта и доступна любому
        Пользователю сети Интернет при переходе по гипертекстовой ссылке
        «Политика конфиденциальности».
      </p>
      <p className={styles.text}>
        2.5. Администрация Сайта вправе вносить изменения в настоящую Политику
        конфиденциальности.
      </p>
      <p className={styles.text}>
        2.6. При внесении изменений в Политику конфиденциальности, Администрация
        Сайта уведомляет об этом Пользователя путём размещения новой редакции
        Политики конфиденциальности на Сайте https://golda-group.ua/.
      </p>
      <p className={styles.text}>
        2.7. При размещении новой редакции Политики конфиденциальности на Сайте,
        предыдущая редакция хранятся в архиве документации Администрации Сайта.
      </p>
      <p className={styles.text}>
        2.8. Используя Форму обратной связи, Пользователь выражает свое согласие
        с условиями настоящей Политики конфиденциальности.
      </p>
      <p className={styles.text}>
        2.9. Администрация Сайта не проверяет достоверность получаемой
        (собираемой) информации о Пользователе.
      </p>
      <Subsubheading text="3. УСЛОВИЯ И ЦЕЛИ СБОРА И ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ" />
      <p className={styles.text}>
        3.1. Персональные данные Пользователя такие как: имя, фамилия, отчество,
        e-mail, телефон, skype и др., передаются Пользователем Администрации
        Сайта с согласия Пользователя.
      </p>
      <p className={styles.text}>
        3.2. Передача персональных данных Пользователем Администрации Сайта,
        через Форму обратной связи означает согласие Пользователя на передачу
        его персональных данных.
      </p>
      <p className={styles.text}>
        3.3. Администрация Сайта осуществляет обработку информации о
        Пользователе, в т.ч. его персональных данных, таких как: имя, фамилия,
        отчество, e-mail, телефон, skype и др., а также дополнительной
        информации о Пользователе, предоставляемой им по своему желанию:
        организация, город, должность и др. в целях выполнения обязательств
        перед Пользователем Сайта.
      </p>
      <p className={styles.text}>
        3.4. Обработка персональных данных осуществляется на основе принципов:
      </p>
      <p className={styles.text}>
        а) законности целей и способов обработки персональных данных и
        добросовестности;
      </p>
      <p className={styles.text}>
        б) соответствия целей обработки персональных данных целям, заранее
        определенным и заявленным при сборе персональных данных;
      </p>
      <p className={styles.text}>
        в) соответствия объёма и характера обрабатываемых персональных данных
        способам обработки персональных данных и целям обработки персональных
        данных;
      </p>
      <p className={styles.text}>
        г) недопустимости объединения созданных для несовместимых между собой
        целей баз данных, содержащих персональные данные.
      </p>
      <p className={styles.text}>
        3.5. Администрация Сайта осуществляет обработку персональных данных
        Пользователя с его согласия в целях оказания услуг/продажи товаров,
        предлагаемых на Сайте.
      </p>
      <Subsubheading text="4. ХРАНЕНИЕ И ИСПОЛЬЗОВАНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ" />
      <p className={styles.text}>
        Персональные данные Пользователя хранятся исключительно на электронных
        носителях и используются строго по назначению, оговоренному в п.3
        настоящей Политики конфиденциальности.
      </p>
      <Subsubheading text="5. ПЕРЕДАЧА ПЕРСОНАЛЬНЫХ ДАННЫХ" />
      <p className={styles.text}>
        5.1. Персональные данные Пользователя не передаются каким-либо третьим
        лицам, за исключением случаев, прямо предусмотренных настоящей Политикой
        конфиденциальности.
      </p>
      <p className={styles.text}>
        5.2. Предоставление персональных данных Пользователя по запросу
        государственных органов, органов местного самоуправления осуществляется
        в порядке, предусмотренном законодательством Российской Федерации.
      </p>
      <Subsubheading text="6. СРОКИ ХРАНЕНИЯ И УНИЧТОЖЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ" />
      <p className={styles.text}>
        6.1. Персональные данные Пользователя хранятся на электронном носителе
        сайта бессрочно.
      </p>
      <p className={styles.text}>
        6.2. Персональные данные Пользователя уничтожаются при желании самого
        пользователя на основании его обращения, либо по инициативе
        Администратора сайта без объяснения причин путём удаления Администрацией
        Сайта информации, размещённой Пользователем.
      </p>
      <Subsubheading text="7. ПРАВА И ОБЯЗАННОСТИ ПОЛЬЗОВАТЕЛЕЙ" />
      <p className={styles.text}>
        Пользователи вправе на основании запроса получать от Администрации Сайта
        информацию, касающуюся обработки его персональных данных.
      </p>
      <Subsubheading text="8. МЕРЫ ПО ЗАЩИТЕ ИНФОРМАЦИИ О ПОЛЬЗОВАТЕЛЯХ" />
      <p className={styles.text}>
        Администратор Сайта принимает технические и организационно-правовые меры
        в целях обеспечения защиты персональных данных Пользователя от
        неправомерного или случайного доступа к ним, уничтожения, изменения,
        блокирования, копирования, распространения, а также от иных
        неправомерных действий.
      </p>
      <Subsubheading text="9. ОБРАЩЕНИЯ ПОЛЬЗОВАТЕЛЕЙ" />
      <p className={styles.text}>
        9.1. Пользователь вправе направлять Администрации Сайта свои запросы, в
        т.ч. относительно использования/удаления его персональных данных,
        предусмотренные п.3 настоящей Политики конфиденциальности в письменной
        форме по адресу, указанному в п.1.
      </p>
      <p className={styles.text}>
        9.2. Запрос, направляемый Пользователем, должен содержать следующую
        информацию:
      </p>
      <p className={styles.text}>для физического лица:</p>
      <p className={styles.text}>
        – номер основного документа, удостоверяющего личность Пользователя или
        его представителя;
      </p>
      <p className={styles.text}>
        – сведения о дате выдачи указанного документа и выдавшем его органе;
      </p>
      <p className={styles.text}>
        – дату регистрации через Форму обратной связи;
      </p>
      <p className={styles.text}>– текст запроса в свободной форме;</p>
      <p className={styles.text}>
        – подпись Пользователя или его представителя.
      </p>
      <p className={styles.text}>для юридического лица:</p>
      <p className={styles.text}>
        – запрос в свободной форме на фирменном бланке;
      </p>
      <p className={styles.text}>
        – дата регистрации через Форму обратной связи;
      </p>
      <p className={styles.text}>
        – запрос должен быть подписан уполномоченным лицом с приложением
        документов, подтверждающих полномочия лица.
      </p>
      <p className={styles.text}>
        9.3. Администрация Сайта обязуется рассмотреть и направить ответ на
        поступивший запрос Пользователя в течение 30 дней с момента поступления
        обращения.
      </p>
      <p className={styles.text}>
        9.4. Вся корреспонденция, полученная Администрацией от Пользователя
        (обращения в письменной/электронной форме) относится к информации
        ограниченного доступа и без письменного согласия Пользователя
        разглашению не подлежит. Персональные данные и иная информация о
        Пользователе, направившем запрос, не могут быть без специального
        согласия Пользователя использованы иначе, как для ответа по теме
        полученного запроса или в случаях, прямо предусмотренных
        законодательством.
      </p>
    </section>
  );
}

export default PrivacyPolicy;
