// eslint-disable-next-line no-restricted-imports
import styles from "../contract-offer/contract-offer.module.scss";
import { Subsubheading } from "@pages/contract-offer/contract-offer";

function PrivacyPolicy() {
  return (
    <section className={styles.container}>
      <h3 className={styles.heading}>Політика конфіденційності</h3>
      <p className={styles.text}>
        Ця Політика конфіденційності персональних даних (далі – Політика
        конфіденційності) діє щодо всієї інформації, яку Інтернет-магазин Golda
        Group, розташований на доменному імені https://www.golda-group.com, може
        отримати про Користувач під час використання сайту Інтернет-магазину,
        програм та продуктів Інтернет-магазин.
      </p>
      <Subsubheading text="1. ВИЗНАЧЕННЯ ТЕРМІНІВ" />
      <p className={styles.text}>
        1.1. У цій Політиці конфіденційності використовуються такі терміни:
      </p>
      <p className={styles.text}>
        1.1.1. «Адміністрація сайту Інтернет-магазину (далі – Адміністрація
        сайту)» – уповноважені співробітники на управління сайтом, що діють від
        імені Golda Group, які організують та (або) здійснює обробку
        персональних даних, а також визначає цілі обробки персональних даних
        даних, склад персональних даних, що підлягають обробці, дії (Операції),
        що здійснюються з персональними даними.
      </p>
      <p className={styles.text}>
        1.1.2. «Персональні дані» — будь-яка інформація, що стосується прямо або
        опосередковано визначеній чи визначеній фізичній особі (суб'єкту
        персональних даних).
      </p>
      <p className={styles.text}>
        1.1.3. "Обробка персональних даних" - будь-яка дія (операція) або
        сукупність дій (операцій), що здійснюються з використанням коштів
        автоматизації або без використання таких коштів із персональними даними,
        включаючи збирання, запис, систематизацію, накопичення, зберігання,
        уточнення (оновлення, зміна), вилучення, використання, передачу
        (поширення, надання, доступ), знеособлення, блокування, видалення,
        знищення персональних даних.
      </p>
      <p className={styles.text}>
        1.1.4. "Конфіденційність персональних даних" - обов'язкове для
        дотримання Оператором або іншим, хто отримав доступ до персональних
        даних особою вимога не допускати їх розповсюдження без згоди суб'єкта
        персональних даних чи наявності іншої законної підстави.
      </p>
      <p className={styles.text}>
        1.1.5. «Користувач сайту Інтернет-магазину (далі Користувач)» – особа,
        яка має доступ до Сайту, через мережу Інтернет та використовує Сайт
        інтернет-магазину.
      </p>
      <p className={styles.text}>
        1.1.6. "Cookies" - невеликий фрагмент даних, надісланий веб-сервером і
        зберігається на комп'ютері користувача, який веб-клієнт або веб-браузер
        щоразу пересилає веб-серверу в HTTP-запиті під час спроби відкрити
        сторінку відповідного сайту.
      </p>
      <p className={styles.text}>
        1.1.7. IP-адреса — унікальна мережна адреса вузла в комп'ютерній мережі,
        побудованої за протоколом ІР.
      </p>
      <Subsubheading text="2. ЗАГАЛЬНІ ПОЛОЖЕННЯ" />

      <p className={styles.text}>
        2.1. Використання Користувачем сайту Інтернет-магазину означає згоду з
        цією Політикою конфіденційності та умовами обробки персональних даних
        Користувача.
      </p>
      <p className={styles.text}>
        2.2. У разі незгоди з умовами Політики конфіденційності Користувач
        повинен припинити використання веб-сайту Інтернет-магазину.
      </p>
      <p className={styles.text}>
        2.3. Ця Політика конфіденційності застосовується лише до сайту
        Інтернет-магазин Golda Group. Інтернет-магазин не контролює та не несе
        відповідальність за сайти третіх осіб, на які Користувач може перейти за
        посиланнями, доступними на сайті Інтернет-магазину.
      </p>
      <p className={styles.text}>
        2.4. Адміністрація сайту не перевіряє достовірність персональних даних,
        що надаються Користувачем сайту Інтернет-магазину.
      </p>
      <Subsubheading text="3. ПРЕДМЕТ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ" />

      <p className={styles.text}>
        3.1. Ця Політика конфіденційності встановлює зобов'язання Адміністрації
        сайту інтернет-магазину з нерозголошення та забезпечення режиму захисту
        конфіденційності персональних даних, які Користувач надає за запитом
        Адміністрації сайту при реєстрації на сайті інтернет-магазину або при
        оформленні замовлення для придбання товару.
      </p>
      <p className={styles.text}>
        3.2. Персональні дані, дозволені для обробки в рамках цієї Політики
        конфіденційності надаються Користувачем шляхом заповнення форми оплати
        на Сайті інтернет-магазину Golda Group в розділ Оформлення замовлення та
        включають наступну інформацію:
      </p>
      <p className={styles.text}>
        3.2.1. Прізвище, ім'я, по-батькові Користувача;
      </p>
      <p className={styles.text}>3.2.2. Контактний телефон Користувача;</p>
      <p className={styles.text}>3.2.3. Адреса електронної пошти (e-mail);</p>
      <p className={styles.text}>
        3.3. Інтернет-магазин захищає Дані, які автоматично передаються у
        процесі перегляду рекламних блоків та при відвідуванні сторінок, на яких
        встановлено статистичний скрипт системи (піксель):
      </p>
      <p className={styles.text}>ІР-адреса;</p>
      <p className={styles.text}>інформація з cookies;</p>
      <p className={styles.text}>
        інформація про браузер (або іншу програму, яка здійснює доступ до показу
        реклами); час доступу;
      </p>
      <p className={styles.text}>
        адресу сторінки, де розташований рекламний блок;
      </p>
      <p className={styles.text}>реферер (адреса попередньої сторінки).</p>
      <p className={styles.text}>
        3.3.1. Відключення cookies може спричинити неможливість доступу до
        частин сайту Інтернет-магазину, який вимагає авторизації.
      </p>
      <p className={styles.text}>
        3.3.2. Інтернет-магазин здійснює збір статистики про IP-адреси своїх.
        відвідувачів. Ця інформація використовується з метою виявлення та
        вирішення технічних проблем, для контролю законності фінансових
        платежів.
      </p>
      <p className={styles.text}>
        3.4. Будь-яка інша персональна інформація не обумовлена ​​вище (історія
        покупок, що використовуються браузери та операційні системи і т.д.)
        підлягає надійного зберігання та нерозповсюдження, за винятком випадків,
        передбачених у п.п. 5.2. та 5.3. цієї Політики конфіденційності.
      </p>
      <Subsubheading text="4. ЦІЛІ ЗБОРУ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ КОРИСТУВАЧА" />

      <p className={styles.text}>
        4.1. Персональні дані Користувача Адміністрація сайту інтернет-магазин
        може використовувати з метою:
      </p>
      <p className={styles.text}>
        4.1.1. Ідентифікації Користувача, зареєстрованого на сайті
        Інтернет-магазину, для оформлення замовлення та (або) укладання Договору
        купівлі-продажу товару дистанційним способом із Golda Group.
      </p>
      <p className={styles.text}>
        4.1.2. Надання Користувачеві доступу до персоналізованих ресурсам Сайту
        інтернет-магазину.
      </p>
      <p className={styles.text}>
        4.1.3. Встановлення з Користувачем зворотного зв'язку, включаючи
        напрямок повідомлень, запитів щодо використання Сайту інтернет-магазину,
        надання послуг, обробка запитів та заявок від Користувача.
      </p>
      <p className={styles.text}>
        4.1.4. Визначення місця знаходження Користувача для забезпечення
        безпеки, запобігання шахрайству.
      </p>
      <p className={styles.text}>
        4.1.5. Підтвердження достовірності та повноти персональних даних,
        наданих Користувачем.
      </p>
      <p className={styles.text}>
        4.1.6. Створення облікового запису для здійснення покупок, якщо
        Користувач дав згоду створення облікового запису.
      </p>
      <p className={styles.text}>
        4.1.7. Повідомлення Користувача Сайту інтернет-магазину про стан
        Замовлення.
      </p>
      <p className={styles.text}>
        4.1.8. Оброблення та отримання платежів, підтвердження податку або
        податкових пільг, заперечення платежу, визначення права на отримання
        кредитної лінії Користувачем.
      </p>
      <p className={styles.text}>
        4.1.9. Надання Користувачеві ефективної клієнтської та технічної
        підтримки при виникненні проблем, пов'язаних з використанням Сайту
        інтернет-магазину.
      </p>
      <p className={styles.text}>
        4.1.10. Надання Користувачеві за його згодою, оновлень продукції,
        спеціальних пропозицій, інформації про ціни, новинну розсилки та інших
        відомостей від імені Інтернет-магазину або від імені партнерів
        Інтернет-магазину.
      </p>
      <p className={styles.text}>
        4.1.11. Здійснення рекламної діяльності за згодою Користувача.
      </p>
      <p className={styles.text}>
        4.1.12. Надання доступу Користувачеві на сайти чи сервіси партнерів
        Інтернет-магазину з метою отримання продуктів, оновлень та послуг.
      </p>
      <Subsubheading text="5. СПОСОБИ ТА ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ" />

      <p className={styles.text}>
        5.1. Обробка персональних даних Користувача здійснюється без обмеження
        строку, будь-яким законним способом, у тому числі в інформаційних
        системах персональних даних з використанням засобів автоматизації або
        без використання коштів.
      </p>
      <p className={styles.text}>
        5.2. Користувач погоджується з тим, що Адміністрація сайту має право
        передавати персональні дані третім особам, зокрема кур'єрським службам,
        організаціями поштового зв'язку, операторам електрозв'язку, виключно з
        метою виконання замовлення Користувача, оформленого на Сайт
        інтернет-магазину Golda Group, включаючи доставку Товару.
      </p>
      <p className={styles.text}>
        5.3. Персональні дані Користувача можуть бути передані уповноваженим
        органам державної влади України тільки на підставах та в порядку,
        встановленим законодавством України.
      </p>
      <p className={styles.text}>
        5.4. У разі втрати або розголошення персональних даних Адміністрація
        сайту інформує Користувача про втрату або розголошення персональних
        даних.
      </p>
      <p className={styles.text}>
        5.5. Адміністрація сайту приймає необхідні організаційні та технічні
        заходи для захисту персональної інформації Користувача від
        неправомірного або випадкового доступу, знищення, зміни, блокування,
        копіювання, розповсюдження, а також від інших неправомірні дії третіх
        осіб.
      </p>
      <p className={styles.text}>
        5.6. Адміністрація сайту спільно з Користувачем приймає все необхідні
        заходи щодо запобігання збиткам чи іншим негативним наслідків,
        викликаних втратою чи розголошенням персональних даних Користувача.
      </p>
      <Subsubheading text="6. ОБОВ'ЯЗКИ СТОРІН" />

      <p className={styles.text}>6.1. Користувач зобов'язаний:</p>
      <p className={styles.text}>
        6.1.1. Надати інформацію про персональні дані, необхідну для
        користування Сайтом інтернет-магазину.
      </p>
      <p className={styles.text}>
        6.1.2. Оновити, доповнити надану інформацію про персональні даних у разі
        зміни цієї інформації.
      </p>
      <p className={styles.text}>6.2. Адміністрація сайту зобов'язана:</p>
      <p className={styles.text}>
        6.2.1. Використовувати отриману інформацію виключно для цілей,
        зазначених у п. 4 цієї Політики конфіденційності.
      </p>
      <p className={styles.text}>
        6.2.2. Забезпечити зберігання конфіденційної інформації в таємниці, не
        розголошувати без попереднього письмового дозволу Користувача, а також
        не здійснювати продаж, обмін, опублікування або розголошення іншими
        можливими способами переданих персональних даних Користувача, крім п.п.
        5.2. та 5.3. цієї Політики Конфіденційності.
      </p>
      <p className={styles.text}>
        6.2.3. Вживати запобіжних заходів для захисту конфіденційності
        персональних даних Користувача згідно з порядком, який зазвичай
        використовується для захисту такого роду інформації у існуючому діловому
        обороті.
      </p>
      <p className={styles.text}>
        6.2.4. Здійснити блокування персональних даних, що належать до
        відповідному Користувачеві з моменту звернення або запиту Користувача
        або його законного представника чи уповноваженого органу із захисту прав
        суб'єктів персональних даних на період перевірки, у разі виявлення
        недостовірних персональних даних або неправомірних дій.
      </p>
      <Subsubheading text="7. ВІДПОВІДАЛЬНІСТЬ СТОРІН" />

      <p className={styles.text}>
        7.1. Адміністрація сайту, яка не виконала свої зобов'язання, несе
        відповідальність за збитки, зазнані Користувачем у зв'язку з
        неправомірним використанням персональних даних, відповідно до
        законодавством України, за винятком випадків, передбачених п.п. 5.2.,
        5.3. та 7.2. цієї Політики Конфіденційності.
      </p>
      <p className={styles.text}>
        7.2. У разі втрати або розголошення Конфіденційної інформації
        Адміністрація сайту не несе відповідальності, якщо дана конфіденційна
        інформація:
      </p>
      <p className={styles.text}>
        7.2.1. Стала громадським надбанням до її втрати чи розголошення.
      </p>
      <p className={styles.text}>
        7.2.2. Була отримана від третьої сторони до її отримання Адміністрація
        сайту.
      </p>
      <p className={styles.text}>
        7.2.3. Була розголошена за згодою Користувача.
      </p>
      <Subsubheading text="8. Вирішення суперечок" />

      <p className={styles.text}>
        8.1. До звернення до суду з позовом щодо спорів, що виникають із
        відносин між Користувачем сайту Інтернет-магазину та Адміністрацією
        сайту, обов'язковим є пред'явлення претензії (письмової пропозиції про
        добровільне врегулювання спору).
      </p>
      <p className={styles.text}>
        8.2. Одержувач претензії протягом 30 календарних днів з дня отримання
        претензії, письмово повідомляє заявника претензії про результати розгляд
        претензії.
      </p>
      <p className={styles.text}>
        8.3. При недосягненні угоди спір буде передано на розгляд судовий орган
        відповідно до чинного законодавства України.
      </p>
      <p className={styles.text}>
        8.4. До цієї Політики конфіденційності та відносин між Користувачем та
        Адміністрацією сайту застосовується чинне законодавство України.
      </p>
      <Subsubheading text="9. ДОДАТКОВІ УМОВИ" />

      <p className={styles.text}>
        9.1. Адміністрація сайту має право вносити зміни до цієї Політики.
        конфіденційності без згоди Користувача.
      </p>
      <p className={styles.text}>
        9.2. Нова Політика конфіденційності набирає чинності з її розміщення на
        Сайті інтернет-магазину, якщо інше не передбачено новою редакцією
        Політики конфіденційності.
      </p>
      <p className={styles.text}>
        9.3. Усі пропозиції чи питання щодо цієї Політики конфіденційності слід
        повідомляти на адресу goldagrooup@gmail.com
      </p>
      <p className={styles.text}>
        9.4. Діюча Політика конфіденційності розміщена на сторінці адресою
        http://localhost:3000/privacyPolicy
      </p>
    </section>
  );
}
export default PrivacyPolicy;
