// eslint-disable-next-line no-restricted-imports
import styles from "./contract-offer.module.scss";

function ContacrtOffer() {
  return (
    <section className={styles.container}>
      <h3 className={styles.heading}>Договор Оферты</h3>
      <div className={styles.dash}></div>
      <Subheading text="Договор Оферты" />
      <p className={styles.text}>
        Путем размещения данного Публичного договора купли-продажи товара, а
        также информации, которая содержится на этом сайте
        https://camotec.ua/ru/ (Интернет-магазине https://camotec.ua/ru/shop -
        далее "магазин"), и имеет следующее название САМО-ТЕС, camotec (далее -
        "сайт"), продавец (физическое лицо-предприниматель Шевелев Сергей
        Александрович, правообладатель товарной марки /знака для товаров и
        услуг, промышленного образца/ САМО-ТЕС, camotec) делает предложение
        (оферту) неограниченному числу физических или юридических лиц с целью
        покупки товаров, размещенных на сайте /в магазине, на условиях этого
        публичного договора купли-продажи товара.
      </p>
      <p className={styles.text}>
        Использование пользователем (клиентом), далее по тексту – Покупателем,
        сервисов сайта/магазина свидетельствует о присоединении Покупателя к
        этому Договору в полном объеме и подтверждает его согласие на следующие
        условия.
      </p>
      <Subheading text="ПУБЛИЧНЫЙ ДОГОВОР КУПЛИ-ПРОДАЖИ ТОВАРА" />
      <Subheading
        customStyle={{ paddingBottom: "20px" }}
        text="Условия, используемые в данном Публичном договоре купли-продажи товара"
      />
      <p className={styles.text}>
        1. Публичный договор купли-продажи товаров (далее "Договор") – договор,
        в котором Продавец берет на себя обязательство продать товар/ы каждому
        лицу, которое обратится к нему (Покупателю).
      </p>
      <p className={styles.text}>
        2. Продавец – физическое лицо-предприниматель, который размещает на
        сайте информацию о товаре, который он реализовывает/продает. Продавцом
        может быть любое лицо, которому правообладателем предоставлено такое
        право продажи товара. Наименование Продавца указывается в документах о
        передаче товара (накладной) Покупателю.
      </p>
      <p className={styles.text}>
        3. Покупатель – лицо (или физическое или предприниматель или
        юридическое), которое покупает, заказывает, использует или намеревается
        приобрести или заказать товар.
      </p>
      <p className={styles.text}>
        4. Оферта – предложение Продавца в адрес любого лица относительно
        заключения этого Договора.
      </p>
      <p className={styles.text}>
        5. Акцепт – предоставление лицом (Покупателем) полного и безусловного
        согласия на заключение этого Договора на условиях, изложенных в этом
        Договоре.
      </p>
      <p className={styles.text}>
        6. Товар – товары, ассортимент, цена и характеристики которых указаны на
        сайте Продавца.
      </p>
      <p className={styles.text}>
        7. Доставка товара – действия Сторон этого Договора, которые приводят к
        прибытию товара к месту его доставки.
      </p>
      <p className={styles.text}>
        8. Место доставки товара – адрес, по которому осуществляется доставка
        товара по этому Договору.
      </p>
      <p className={styles.text}>
        9. Принятие и передача товара – действия Сторон этого Договора (или
        третьей стороны со стороны Покупателя), которые приводят к фактической
        передаче товара от одной Стороны этого Договора другой и выдаются путем
        подписания Сторонами накладной или другого документа, указывающего на
        передачу товара одной Стороной этого Договора или перевозчиком другой
        Стороне этого Договора.
      </p>
      <p className={styles.text}>
        10. Сторона (стороны) по этому Договору – Продавец или Покупатель
        (Продавец и Покупатель) с учетом содержания условий этого Договора.{" "}
      </p>
      <p className={styles.text}>
        11. Согласие на обработку и хранение персональных данных является
        согласием пользователя сайта и/или пользователя чат-бота, при заполнении
        любого заявления, запроса, формы или иным образом предоставления своих
        личных данных (полное имя, контактные номера телефонов, адреса
        электронной почты и другие предоставленные личные данные) через чат-бот
        или сайт или, продолжая использовать сайт или чат-бот, действуя
        свободно, по своей собственной воли и в своих интересах, а также
        подтверждая свою дееспособность и правоспособность, предоставить
        собственнику сайта и/или его администратору согласие на:{" "}
      </p>
      <p className={styles.text}>
        сбор, запись, обработку, накопление, систематизацию, хранение,
        уточнение, обновление персональных данных, в частности паспортных
        данных, персональных данных (возраст, пол), информации о
        зарегистрированном или фактическом месте жительства, о регистрации
        физического лица в Государственном реестре физических лиц -
        налогоплательщиков, идентификационных данных в электронной форме
        (биографические справки, номера телефонов), записи изображений (фото)
        (на бумажных носителях, на бланках картотек, в информационных
        (автоматизированных) системах и т.д., в том числе в плане регистрации и
        хранения таких данных в перечне клиентов), для реализации прав и
        обязанностей, определенных действующим законодательством Украины и
        заключенными договорами/соглашения; использование персональных данных,
        которое предусматривает любые действия владельца персональных данных для
        обработки таких данных, их защиту, а также действия по предоставлению
        частичного или полного права на обработку персональных данных другим
        субъектам отношений; передача, распространение персональных данных, что
        предусматривает действия по передаче информации о физическом лице;
        доступ к персональным данным третьих лиц; получение информации по
        каналам связи, включая рекламные сообщения через SMS-сообщения,
        мессенджеры, социальные сети или адреса электронной почты. Согласие
        дается на обработку персональных данных об использовании средств
        автоматизации и действует все время до момента прекращения или их
        отзыва.
      </p>
      <p className={styles.text}>
        Согласие вступает в силу с момента его принятия путем регистрации на
        сайте и /или предоставления (размещения) персональных данных на сайте.
      </p>
      <Subsubheading text="1. Акцептирование Договора" />
      <p className={styles.text}>
        1.1. Подтверждением акцептирования Покупателем условий этого Договора
        является размещение Покупателем на сайте https://camotec.ua/ru/shop
        заказа на соответствующий товар.
      </p>
      <p className={styles.text}>
        1.2. С момента получения Продавцом заказа на товар от Покупателя
        считается, что этот Договор заключен.
      </p>
      <p className={styles.text}>
        1.3. Осуществление Покупателем акцептирования подтверждает, что
        Покупатель ознакомился с содержанием этого Договора, наименованием
        Продавца, порядок принятия претензий, с характеристиками товара, ценой
        товара, условиями оплаты стоимости товара, условиями доставки товара и
        оплатой стоимости такой доставки, гарантийными обязательствами на товар,
        порядком расторжения этого Договора, условия и содержание этого Договора
        полностью понятны Покупателю, он не имеет никаких несогласованных
        вопросов, и т.п..
      </p>
      <Subsubheading text="2. Предмет Договора" />
      <p className={styles.text}>
        2.1. Продавец обязуется передать в собственность Покупателю заказанный
        им товар, который имеется в наличии, а Покупатель обязуется оплатить и
        принять заказанный товар на сайте.
      </p>
      <p className={styles.text}>
        2.2. Количество и полное название товара будут определяться на основании
        заказа Покупателя и указываются в накладной.
      </p>
      <p className={styles.text}>
        2.3. Стороны в соответствии с этим Договором подтверждают, что
        заключение этого Договора осуществляется на основе свободного
        волеизъявления каждой из Сторон и при полном понимании предмета и
        условий этого Договора.
      </p>
      <p className={styles.text}>
        2.4.Заключением этого Договора, Покупатель подтверждает, что он знаком с
        информацией об условиях поставки и сроках оплаты стоимости поставки
        товара, который продан по условиям этого Договора, а также с информацией
        о самом товаре, а именно о его форме, размерах, внешнем виде, дизайне,
        цвете, размере, его качестве, характеристиках материала, из которого
        произведен товар, и с информацией о его производителе, осознает такие
        характеристики товара и их значение, и согласен на приобретение такого
        товара с такими характеристиками.
      </p>
      <p className={styles.text}>
        2.5. Покупатель обязуется не совершать дискриминационных действий,
        недобросовестную конкуренцию, неправомерное использование деловой
        репутации Продавца и/или относительно Продавца (или в случае обозначения
        товара надлежащим Продавцу) знаком для товаров и услуг и/или как
        промышленного образца (далее – ТМ) и в отношении владельца /
        правообладателя такой ТМ).
      </p>
      <p className={styles.text}>
        2.6. Покупатель обязуется не копировать, не модифицировать и не
        использовать в своей деятельности ТМ, которой обозначен товар по этому
        Договору.
      </p>
      <Subsubheading text="3. Срок и условия доставки товара, условия приема-передачи товаров" />
      <p className={styles.text}>
        3.1. Срок в течение которого Продавец обязан доставить Покупателю
        заказанный им товар, предусмотренный заказом на сайте, составляет до 7
        рабочих дней, а в случае заказа товара стоимостью до 500 грн. с даты
        оплаты Покупателем стоимости транспортных расходов / стоимости доставки
        на условиях, и за тарифами и т.д. соответствующей службы доставки
        (например, Новая почта, Деливери, Мист-Экспресс, и т.д.).
      </p>
      <p className={styles.text}>
        3.2. Стороны договорились, что Продавец имеет право не приступать к
        выполнению условий этого Договора в случае неуплаты Покупателем
        определенных в нем платежей, в т.ч., но не исключительно, в случаях
        неуплаты стоимости транспортных расходов по доставке Покупателю товара в
        определенное последнее место, или не оплаты стоимости товара на
        условиях, предусмотренных настоящим Договором.
      </p>
      <p className={styles.text}>
        3.3. Права собственности на товар, а также риск его гибели или
        повреждения переходит от Продавца к Покупателю с момента принятия товара
        Покупателем или перевозчиком в соответствии с накладной или иного
        документа, установленного перевозчиком, подтверждающего получение товара
        Покупателем или перевозчиком. Риск случайной порчи или потери
        поставляемого товара, переходит от Продавца к Покупателю вместе с
        возникновением у последнего права собственности на такой товар.
      </p>
      <p className={styles.text}>
        3.4. Продавец обязан поставить товар в количестве, ассортименте,
        согласно накладной на основании заказа Покупателя, сформированного в его
        личном кабинете на сайте, а Покупатель обязан оплатить товар.
      </p>
      <p className={styles.text}>
        3.5. Доставка товара происходит по усмотрению Покупателя или его силами
        или силами третьих лиц, оказывающих услуги перевозки товара
        (перевозчиком). Стороны установили, что Покупатель вправе самостоятельно
        определять перевозчика товара по согласованию с Покупателем.
      </p>
      <p className={styles.text}>
        3.5.1. Доставка товара происходит силами перевозчика за счет Покупателя
        по адресу, указанному Покупателем в заказе на товар (далее по тексту –
        место доставки товара).
      </p>
      <p className={styles.text}>
        3.5.2. Заказ доставки товара у перевозчика, указанного на сайте,
        осуществляет Продавец на основании информации заказа Покупателя.
      </p>
      <p className={styles.text}>
        3.5.3. Со стоимостью услуги доставки соответствующего товара Покупатель
        может ознакомиться на сайте соответствующего перевозчика.
      </p>
      <p className={styles.text}>
        3.5.4. В случае безосновательного неприятие Покупателем товара,
        доставленного (направленного) Продавцом (перевозчиком) Покупателю или в
        случае возврата товара Покупателем Продавцу, за исключением случаев
        возврата некачественного / некомплектного / несоответствующего
        ассортимента товара Продавец имеет право: - не возвращать Покупателю
        уплаченные денежные средства в качестве возмещения транспортных расходов
        /стоимость доставки при заказе товара стоимость до 500 грн./; - при
        возврате денежных средств, уплаченных Покупателем за такой товар,
        удержать сумму понесенных расходов, которые представляют собой
        транспортные расходы / стоимость доставки такого товара Покупателю.
      </p>
      <p className={styles.text}>
        3.5.5. Покупатель подтверждает и свое согласие с условиями п.3.5. этого
        Договора.
      </p>
      <p className={styles.text}>
        3.6. Об ориентировочной дате доставки перевозчиком товара Покупателю
        Продавец с учетом информации перевозчика сообщает Покупателю посредством
        телефонной связи по номеру телефона Покупателя, указанным в заказе на
        товар. Покупатель обязан обеспечить свое присутствие или присутствие
        третьих лиц, которые могли бы осуществить принятие товара, по месту его
        доставки в установленную Продавцом (перевозчиком) дату. Покупатель
        обязан принять товар по месту его доставки.
      </p>
      <p className={styles.text}>
        В случае получения Покупателем по определенному им месту доставки товара
        такой товар хранится на условиях, определенных перевозчиком, при этом
        стоимость каждого дня хранения товара, в течение срока, который
        начинается после истечения срока передачи товара, установленного п.3.1.
        этого Договора, устанавливается перевозчиком и составляет сумму,
        определяемую за каждый день хранения. Покупатель обязан оплатить
        стоимость такого хранения в пользу такого перевозчика за весь срок
        хранения такого товара.
      </p>
      <p className={styles.text}>
        В случае если товар не был принят (вывезен) Покупателем в течение 7
        календарных дней после истечения срока передачи товара, установленного
        п.3.1. этого Договора, Продавец вправе распорядиться таким товаром по
        своему усмотрению без возврата Покупателю стоимости такого товара.
        Повторная доставка товара Покупателю осуществляется силами и за счет
        Покупателя со склада Продавца (или перевозчика), адрес которого
        сообщается Продавцом по запросу Покупателя дополнительно.
      </p>
      <p className={styles.text}>
        Продавец вправе по собственной согласия осуществить повторную поставку
        товара Покупателю по месту доставки товара за счет Покупателя.
      </p>
      <p className={styles.text}>
        3.7. Стороны договорились, что в случае отсутствия Покупателя по месту
        доставки товара, передача товара может быть осуществлена ​​другому лицу
        (третьему лицу), который находится по месту доставки товара, и который
        имеет при себе и предъявил документ, подтверждающий заключение этого
        Договора (договор и/или квитанция об уплате стоимости товара и/или
        другое) между его Сторонами или оформления доставки товара.
      </p>
      <p className={styles.text}>
        3.8. При приеме-передачи товара Покупатель (или третье лицо) обязано
        проверить ассортимент, количество доставленного товара на соответствие
        заказу Покупателя и накладной на соответствующий товар, а также
        комплектацию товара и наличие видимых недостатков товара.
      </p>
      <p className={styles.text}>
        В случае подписания Покупателем (или третьим лицом) накладной /
        декларации / другого документа, которая/ый подтверждает фактическое
        принятие товара Покупателем (или третьим лицом) от перевозчика,
        Покупатель (или третье лицо) также таким подписанием в том числе
        подтверждает отсутствие претензий по ассортименту, качеству и
        комплектности полученного товара.
      </p>
      <p className={styles.text}>
        3.9. Прием-передача товара по ассортименту и количеству осуществляется в
        соответствии с заказом Покупателя, прием-передача товара по качеству
        осуществляется в соответствии с нормативно-правовыми актами и
        нормативными документами, действие которых распространяется на товар,
        являющийся предметом этого Договора, а также в соответствии с условиями
        этого Договора.
      </p>
      <p className={styles.text}>
        3.10. Продавец обязан предоставить Покупателю (или третьему лицу со
        стороны Покупателя) документы на товар, что обычно требуются.
      </p>
      <p className={styles.text}>
        Накладная на товар и/или другие сопроводительные документы могут быть
        заверены электронной подписью и печатью (при ее наличии) Продавца, и
        предоставляются Продавцом Покупателю путем ее/их направления в личный
        кабинет Покупателя.
      </p>
      <p className={styles.text}>
        3.11. В случае доставки товара перевозчиком, ответственность за
        сохранность товара до момента его передачи Покупателю несет перевозчик.
      </p>
      <p className={styles.text}>
        3.12. Перед заказом товара и его приобретением Продавец регистрирует для
        Покупателя личный кабинет.
      </p>
      <Subsubheading
        text="4. Качество товара, гарантийный срок товара, условия и порядок
        урегулирования вопросов несоответствия товара условиям договора"
      />
      <p className={styles.text}>
        4.1. Качество товара должно соответствовать ГОСТ, ТУ
        (нормативно-правовым актам и/или нормативным документам) или требованиям
        Продавца.
      </p>
      <p className={styles.text}>
        4.2. Продавец гарантирует доставить и передать Покупателю качественный
        товар и отвечающий государственным стандартам (в случае их установления
        для такого вида). Гарантия качества товара распространяется на все
        комплектующие (составные) части товара, если таковые имеют место.
      </p>
      <p className={styles.text}>
        4.3. Гарантийный срок товара указывается в гарантийном талоне на товар.
        Гарантийный срок начинает действие с момента подписания Покупателем
        накладных на соответствующий товар или в другие сроки, предусмотренные
        действующим законодательством Украины.
      </p>
      <p className={styles.text}>
        4.4. Условия гарантийного срока и срока службы товара распространяются
        на товар, в отношении которого Покупателем было предъявлено такие
        документы без исключения:
      </p>
      <p className={styles.text}>
        - гарантийный талон на соответствующий товар;
      </p>
      <p className={styles.text}>- накладная на товар;</p>
      <p className={styles.text}>
        - квитанцию, подтверждающую уплату покупателем стоимости товара.
      </p>
      <p className={styles.text}>
        4.5. Условия гарантийного срока товара и срока службы товара не
        распространяются на товар, ремонт (устранение недостатков) которого
        осуществляется самостоятельно Покупателем или третьими лицами. Условия
        гарантийного срока товара и срока службы товара не распространяются на
        товар, условия эксплуатации и/или транспортировкой и/или сохранения
        которого были нарушены Покупателем.
      </p>
      <p className={styles.text}>
        4.6. Продавец не несет ответственность за использование товара на по
        назначению товара.
      </p>
      <p className={styles.text}>
        4.7. Претензий по количеству и/или ассортимента и/или качеству
        (относительно видимых недостатков товара), и/или комплектности товара
        Покупатель обязан предъявить Продавцу в момент приема-передачи товара
        Покупателю в т.ч. с помощью телефонной связи, если доставка товара
        осуществлялась перевозчиком. Путем заключения этого Договора Стороны по
        этому Договору установили, что указанный срок на предъявление
        Покупателем Продавцу претензий по количеству и / или ассортимента и /
        или качеству (относительно видимых недостатков товара), и/или
        некомплектности товара является разумным.
      </p>
      <p className={styles.text}>
        4.8. После завершения приема-передачи товара Покупателю, он не может
        предъявлять претензии Продавцу по количеству товара и / или ассортимента
        товара и/или ненадлежащего комплектации товара и/или недостатков товара,
        которые могли быть обнаружены Покупателем во время приема-передачи
        товара.
      </p>
      <p className={styles.text}>
        4.9. Претензии по скрытым недостаткам товара, недостаткам, допущенными
        производителем товара и которые не могли быть обнаружены Покупателем в
        момент приема-передачи товара от Продавца Покупателю, могут быть
        предъявлены Покупателем в адрес Продавца в течение всего гарантийного
        срока, распространяется на товар, поставляемый по условиям этого
        Договора.
      </p>
      <p className={styles.text}>
        4.10. В случае обнаружения Покупателем недостатков товара в момент его
        приема-передачи, Покупатель обязан сразу, к оставлению Продавцом
        (представителем Продавца, перевозчиком) места доставки товара и до
        момента подписания Покупателем сопроводительных документов на товар,
        сообщить об этом Продавца.
      </p>
      <p className={styles.text}>
        В случае принятия Сторонами решения о возврате товара, в отношении
        которого возникли вопросы по качеству, продавцу, Покупатель должен
        немедленно, до момента оставления Продавцом или перевозчиком места
        доставки товара, передать Продавцу или перевозчику такой товар с целью
        изучения Продавцом характера, причины появления недостатка товара,
        анализа вопроса возможного устранения недостатка товара и совершения
        других действий, направленных на урегулирование возникших претензий со
        стороны Покупателя. При этом Продавец или перевозчик (по доверенности
        продавца) обязан предоставить Покупателю документ, подтверждающим
        возврат Покупателем Продавцу такого товара (например, но не
        исключительно – акт о возврате товара).
      </p>
      <p className={styles.text}>
        4.11. Стороны договорились, что в случае если, товар, который был
        доставлен Продавцом Покупателю не является укомплектованным должным
        образом, Продавец обязан доукомплектовать товар в течение 20 (двадцати)
        календарных дней с даты получения соответствующей претензии от
        Покупателя.
      </p>
      <p className={styles.text}>
        4.12. Стороны договорились, что в случае если, товар, доставленный
        Покупателю, имеет недостатки, Продавец обязан устранить такие недостатки
        товара в течение 30 (тридцати) календарных дней с даты получения
        соответствующей претензии от Покупателя и получения некачественного
        товара, если возврат товара Продавцу предполагается характером
        установленного недостатка товара.
      </p>
      <p className={styles.text}>
        4.13. Стороны установили, что срок и порядок замены некачественного
        товара регулируются Законом Украины «О защите прав потребителей» и
        осуществляется немедленно или в двухмесячный срок в случае отсутствия
        товара в магазине или на складе Продавца.
      </p>
      <p className={styles.text}>
        4.14. Путем заключения этого Договора Стороны по нему договорились и
        установили, что сроки устранения недостатков и до-укомплектования товара
        в соответствии с п.4.11. и п,4.12. этого Договора являются разумными
        учитывая необходимое время на перевозку товара, изучение характера
        недостатков, времени, необходимого для устранения недостатков товара,
        времени, необходимого для доставки товара Покупателю после устранения
        недостатков, времени, необходимого для до-укомплектации товара и
        времени, необходимого для совершения других действий, связанных с
        приведением товара в соответствие с требованиями этого Договора.
      </p>
      <p className={styles.text}>
        4.15. Стороны по этому Договору договорились, что при возникновении
        разногласий о наличии недостатков товара или причин возникновения таких
        недостатков, Продавец имеет право осуществить осмотр товара по месту
        доставки товара или предложить осуществить Покупателем возврат товара, в
        отношении которого у Покупателя есть претензии относительно его
        качества.
      </p>
      <p className={styles.text}>
        4.16. Порядок удовлетворения обоснованной претензии Покупателя
        осуществляются по соглашению Сторон этого Договора, если иное не
        установлено условиями этого Договора или обязательность определенных
        действий не предусмотрена действующим законодательством Украины.
      </p>
      <p className={styles.text}>
        4.17. Стороны установили, что Покупатель не имеет права на возврат
        товара, который соответствует требованиям этого Договора, заказу на
        сайте, а именно по количеству, ассортименту, комплектности и который был
        доставлен Покупателю в соответствии с условиями этого Договора и заказа
        на сайте.
      </p>
      <Subsubheading text="5. Условия и порядок расчетов между Сторонами" />
      <p className={styles.text}>
        5.1. Расчеты между Сторонами по условиям этого Договора осуществляются в
        национальной валюте Украины путем перечисления Покупателем
        соответствующей денежной суммы на счет Продавца в соответствии с
        банковскими реквизитами, указанными на сайте (или сформированном
        заказе).
      </p>
      <p className={styles.text}>
        5.2. Датой оплаты Покупателем стоимости товара считается дата
        поступления соответствующей суммы денежных средств на счет Продавца.
      </p>
      <p className={styles.text}>
        5.3. Расчет за заказанный Покупателем товар может быть осуществлен
        Покупателем на следующих условиях:
      </p>
      <p className={styles.text}>
        - путем осуществления полной 100% (сто процентной) предоплаты стоимости
        заказанного товара в течение 3 (трех) банковских дней с даты выставления
        Продавцом Покупателю соответствующего счета или предоставления Продавцом
        Покупателю другого документа (сообщения), которое включает в себя все
        реквизиты, необходимые для осуществления оплаты стоимости товара;
      </p>
      <p className={styles.text}>или</p>
      <p className={styles.text}>
        - путем осуществления предоплаты в согласованном Сторонами размере от
        стоимости заказанного товара в течение 3 (трех) банковских дней с даты
        выставления Продавцом Покупателю соответствующего счета или
        предоставления Продавцом Покупателю другого документа (сообщения),
        которое включает в себя все реквизиты, необходимые для осуществления
        оплаты стоимости товара. При этом окончательный расчет за товар
        Покупатель обязан осуществить в день получения соответствующего товара.
      </p>
      <p className={styles.text}>
        5.4. Стоимость доставки товара, в случае доставки товара Покупателю с
        помощью услуг перевозчика, Покупатель обязан осуществить одновременно с
        оплатой стоимости товара согласно п.5.3. этого Договора.
      </p>
      <Subsubheading text="6. Права и обязанности Сторон Договора" />
      <p className={styles.text}>6.1. Обязанности Продавца:</p>
      <p className={styles.text}>
        6.1.1. Осуществить поставку товара соблюдая условия этого Договора.
      </p>
      <p className={styles.text}>6.2. Права Продавца:</p>
      <p className={styles.text}>
        6.2.1. Требовать от Покупателя принятия товара, который поставлен в
        соответствии с условиями этого Договора и заказа Покупателя, сделанного
        им на сайте.
      </p>
      <p className={styles.text}>
        6.2.2. Требовать от Покупателя выполнения и соблюдения условий этого
        Договора надлежащим образом и в установленные сроки.
      </p>
      <p className={styles.text}>
        6.2.3. Отказать Покупателю в продаже товара, которого нет в наличии у
        Продавца.
      </p>
      <p className={styles.text}>6.3. Обязанности Покупателя:</p>
      <p className={styles.text}>
        6.3.1. Принять или обеспечить прием товара у Продавца или перевозчика
        соблюдая условия данного Договора.
      </p>
      <p className={styles.text}>
        6.3.2. Соблюдать условия Договора и выполнять обязанности, которые прямо
        предусмотрены условиями этого Договора или вытекающие из условий этого
        Договора.
      </p>
      <p className={styles.text}>6.4. Права Покупателя:</p>
      <p className={styles.text}>
        6.4.1. Требовать от Продавца доставки и передачи товара в соответствии с
        условиями этого Договора.
      </p>
      <p className={styles.text}>
        6.4.2. Требовать от Продавца выполнения и соблюдения условий этого
        Договора надлежащим образом и в установленные сроки.
      </p>
      <Subsubheading
        text="7. Ответственность Сторон Договора и порядок рассмотрения и
        урегулирования споров"
      />
      <p className={styles.text}>
        7.1. В случае неисполнения или ненадлежащего исполнения любой из Сторон
        обязательных условий этого Договора, такая Сторона несет ответственность
        в соответствии с действующим законодательством Украины.
      </p>
      <p className={styles.text}>
        7.2. Стороны по этому Договору договорились, что любые споры, которые
        могут возникнуть между ними во время действия этого Договора, могут
        решаться путем предъявления одной Стороной по этому Договору другой
        Стороне соответствующей претензии, изложенной в письменном виде или
        любым другим способом, предусмотренным условиями этого Договора.
      </p>
      <p className={styles.text}>
        Рассмотрение претензий осуществляется в течение 20 (двадцати)
        календарных дней с даты получения претензии Стороной, в адрес которой
        такая претензия была направлена, если иное не установлено условиями
        этого Договора.
      </p>
      <p className={styles.text}>
        В случае не достижения Сторонами согласия по возникшему спору, такой
        спор и разногласия разрешаются в соответствии с действующим
        законодательством Украины.
      </p>
      <p className={styles.text}>
        7.3. Продавец освобождается от ответственности за нарушение
        (неисполнение, ненадлежащее исполнение, просрочки исполнения) условий
        этого Договора, если такое нарушение обусловлено действием форс-мажорных
        обстоятельств (обстоятельств непреодолимой силы), возникших после
        заключения этого Договора.
      </p>
      <Subsubheading text="8. Срок действия Договора" />
      <p className={styles.text}>
        8.1. Этот Договор вступает в силу с момента его акцепта Покупателем и
        действует до момента исполнения Продавцом и Покупателем обязательств,
        предусмотренных условиями этого Договора.
      </p>
      <Subsubheading text=" 9. Изменение условий Договора и его расторжения" />
      <p className={styles.text}>
        9.1. Условия этого Договора могут быть изменены или дополнены путем
        размещения их на сайте.
      </p>
      <p className={styles.text}>
        9.2. Стороны договорились, что этот Договор может быть досрочно
        расторгнут в одностороннем порядке любой из Сторон. Договор считается
        расторгнутым в день получения Стороной-получателем уведомления о
        расторжении этого Договора уведомления от другой Стороны по этому
        Договору в т.ч. письменного, но не исключительно.
      </p>
      <p className={styles.text}>
        9.3. Стороны договорились, что в случае расторжения этого Договора по
        инициативе Покупателя или отказа Покупателя от доставки ему товара,
        указанного в заказе, после оплаты его стоимости Продавец имеет право не
        возвращать Покупателю уплаченные им денежные средства или имеет право
        вернуть такие денежные средства частично в размере не больше 0,1% от
        общей стоимости товара, который был заказан Покупателем. Продавец имеет
        право вернуть денежные средства Покупателю в любом другом размере, если
        на то есть взаимное согласие Сторон по этому Договору.
      </p>
      <p className={styles.text}>
        9.4. В случае расторжения этого Договора по инициативе Продавца или в
        случае безосновательного отказа продавца от исполнения условий этого
        Договора, Покупатель вправе потребовать от продавца компенсации в
        размере стоимости товара в соответствии с заказом Покупателя, по
        которому Продавцом не было выполнено обязательств. Покупатель вправе
        требовать компенсации от продавца в любом другом размере, если на то
        есть взаимное согласие сторон по этому Договору.
      </p>
      <Subsubheading text="10. Персональные данные" />
      <p className={styles.text}>
        10.1. Стороны дают добровольное согласие на обработку своих персональных
        данных в объеме, содержащимся в этом Договоре, заказе на сайте, счетах,
        актах, накладных и других документах, касающихся выполнения этого
        Договора.
      </p>
      <p className={styles.text}>
        Присоединение к Договору означает однозначное согласие с вышеизложенным
        и подтверждением того, что уполномоченное лицо каждой из Сторон
        ознакомлено с содержанием ст. 8 Закона Украины «О защите персональных
        данных» и целью обработки персональных данных (не являются
        общедоступными):
      </p>
      <p className={styles.text}>обслуживания запросов, заявок;</p>
      <p className={styles.text}>поддержания связи с пользователем;</p>
      <p className={styles.text}>
        передача информации в том числе рекламной (сообщений) через чат бот или
        на указанный пользователем e-mail, номер телефона, почтовый адрес и
        т.д., в том числе путем отправки рекламных, сервисных и новостных
        рассылок;
      </p>
      <p className={styles.text}>предоставление услуг;</p>
      <p className={styles.text}>продажи товаров;</p>
      <p className={styles.text}>
        заключение договора с пользователем или клиентом и его выполнение;
      </p>
      <p className={styles.text}>
        установление обратной связи, включая направление сообщений, запросов,
        касающихся использования сайта или чат-бота, оказание услуг, обработка
        запросов и заявок;
      </p>
      <p className={styles.text}>определение места нахождения пользователя;</p>
      <p className={styles.text}>
        IP адреса, с которого был выполнен вход на сайт;
      </p>
      <p className={styles.text}>информация с cookies;</p>
      <p className={styles.text}>
        информация о браузер (или другой программы, которая осуществляет доступ
        к сайту);
      </p>
      <p className={styles.text}>время доступа к сайту;</p>
      <p className={styles.text}>посещенных адресов страниц,</p>
      <p className={styles.text}>реферер (адрес предыдущей страницы).</p>
      <p className={styles.text}>
        10.2. Стороны гарантируют, что любые персональные данные, передаваемые в
        соответствии с условиями этого Договора, полученные, обрабатываются и
        передаются в соответствии с требованиями действующего законодательства
        Украины в сфере защиты персональных данных.
      </p>
      <p className={styles.text}>
        Стороны гарантируют, что передача и обработка полученных персональных
        данных осуществляется в целях обеспечения выполнения обязательств по
        этому Договору, в объеме и в пределах, определенных Законом Украины «О
        защите персональных данных».
      </p>
      <p className={styles.text}>
        Способ обработки персональных данных – обработка персональных данных с
        использованием автоматизированной информационной системы.
      </p>
      <p className={styles.text}>
        10.3. Покупатель обязуется в случае изменения персональных данных
        предоставлять в кратчайшие сроки уточненную, достоверную информацию и
        соответствующие документы для их обновления. Покупателю известны права
        субъекта персональных данных, определенные Законом Украины «О защите
        персональных данных», владельца персональных данных, состав и содержание
        собираемых персональных данных, цель сбора таких данных и право передать
        персональные данные.
      </p>
      <p className={styles.text}>
        10.4. В случае нарушения одной из Сторон требований законодательства о
        защите персональных данных, другая Сторона не несет ответственности за
        такое нарушение.
      </p>
      <p className={styles.text}>
        Владелец сайта и/или его администратор не несет никакой ответственности
        за разглашение третьим лицам персональных данных в случае, если такое
        разглашение необходимо для реализации им своих прав и обязанностей,
        определенных действующим законодательством Украины и заключенными
        договорами.
      </p>
      <Subsubheading text="11. Другие условия Договора" />
      <p className={styles.text}>11. Другие условия Договора</p>
      <p className={styles.text}>
        11.1. Этот Договор является обязательным для выполнения его Сторонами.
      </p>
      <p className={styles.text}>
        11.2. Стороны установили, что признание этого Договора недействительным
        в любой его отдельной части не является основанием для признания
        недействительным этого Договора в полном объеме.
      </p>
      <p className={styles.text}>
        11.3. Путем заключения этого Договора Покупатель предоставляет Продавцу
        согласие на обработку и хранение своих персональных данных с целью
        реализации отношений, возникающих между Сторонами на основании этого
        Договора, в целях обеспечения реализации административно-правовых
        отношений, налоговых отношений, отношений в сфере бухгалтерского учета,
        отношений в сфере рекламы, сбора персональных данных в коммерческих
        целях, отношений в сфере статистики в соответствии с действующим
        законодательством Украины.
      </p>
      <p className={styles.text}>
        Заключая этот Договор, Покупатель подтверждает, что предупрежден
        (знаком) со своими правами, предусмотренными ст.8 Закона Украины «О
        защите персональных данных».
      </p>
      <p className={styles.text}>
        11.4. Стороны гарантируют, что на момент заключения этого Договора они
        наделены соответствующими полномочиями и имеют право на заключение этого
        Договора.
      </p>
      <p className={styles.text}>
        11.5. По всем вопросам, которые не предусмотрены условиями этого
        Договора, Стороны руководствуются действующим законодательством Украины.
      </p>
    </section>
  );
}

export default ContacrtOffer;

export function Subheading({
  text,
  customStyle,
}: {
  text: string;
  customStyle?: { [key: string]: string };
}) {
  return (
    <h4 style={customStyle} className={styles.subheading}>
      {text}
    </h4>
  );
}

export function Subsubheading({
  text,
  customStyle,
}: {
  text: string;
  customStyle?: { [key: string]: string };
}) {
  return (
    <h5 style={customStyle} className={styles.subsubheading}>
      {text}
    </h5>
  );
}
