// eslint-disable-next-line no-restricted-imports
import styles from "./contract-offer.module.scss";

function ContacrtOffer() {
  return (
    <section className={styles.container}>
      <h3 className={styles.heading}>Договір Оферти</h3>
      <div className={styles.dash}></div>
      <Subheading text="Договір Оферти" />
      <p className={styles.text}>
        Шляхом розміщення даного Публічного договору купівлі-продажу товару, а
        також інформації, що міститься на цьому сайті https://golda-group.com
        (Інтернет-магазин https://golda-group.com - далі "магазин"), і має таку
        назву Golda Group, продавець (фізична особа-підприємець Бочкарьова Злата
        Олегівна) робить пропозиція (оферту) необмеженому числу фізичних чи
        юридичних осіб осіб з метою купівлі товарів, розміщених на сайті / в
        магазині, умовах цього громадського договору купівлі-продажу товару.
      </p>
      <p className={styles.text}>
        Використання користувачем (клієнтом), далі за текстом – Покупцем,
        сервісів сайту/магазину свідчить про приєднання Покупця до цього
        Договору у повному обсязі та підтверджує його згоду на наступні умови.
      </p>
      <Subheading text="ПУБЛИЧНЫЙ ДОГОВОР КУПЛИ-ПРОДАЖИ ТОВАРА" />
      <Subheading
        customStyle={{ paddingBottom: "20px" }}
        text="Умови, що використовуються у цьому Публічному договорі купівлі-продажу товару"
      />
      <p className={styles.text}>
        1. Публічний договір купівлі-продажу товарів (далі "Договір") – договір,
        у якому Продавець бере на себе зобов'язання продати товар/и кожному
        особі, яка звернеться до неї (Покупцю).
      </p>
      <p className={styles.text}>
        2. Продавець – фізична особа-підприємець, який розміщує на сайті
        інформацію про товар, який він реалізовує/продає. Продавцем може бути
        будь-яка особа, якій правовласником надано таке право продажу товару.
        Найменування Продавця вказується в документах про передачі товару
        (накладної) Покупцеві.
      </p>
      <p className={styles.text}>
        3. Покупець – особа (або фізична або підприємець або юридичне), яке
        купує, замовляє, використовує чи має намір придбати чи замовити товар.
      </p>
      <p className={styles.text}>
        4. Оферта – пропозиція Продавця на адресу будь-якої особи щодо укладання
        цього Договору.
      </p>
      <p className={styles.text}>
        5. Акцепт – надання особою (Покупцем) повного та безумовного згоди на
        укладення цього Договору на умовах, викладених у цьому Договор.
      </p>
      <p className={styles.text}>
        6. Товар – товари, асортимент, ціна та характеристики яких вказано на
        сайті Продавця.
      </p>
      <p className={styles.text}>
        7. Доставка товару – дії Сторін цього Договору, що призводять до
        прибуття товару до місця доставки.
      </p>
      <p className={styles.text}>
        8. Місце доставки товару – адреса, за якою здійснюється доставка товару
        за цим Договором.
      </p>
      <p className={styles.text}>
        9. Прийняття та передача товару – дії Сторін цього Договору (або третьої
        сторони з боку Покупця), які призводять до фактичної передачі товару від
        однієї Сторони цього Договору іншій та видаються шляхом підписання
        Сторонами накладної або іншого документа, що вказує на передачу товару
        однією Стороною цього Договору або перевізником іншою Сторони цього
        Договору.
      </p>
      <p className={styles.text}>
        10. Сторона (сторони) цього Договору – Продавець або Покупець (Продавець
        та Покупець) з урахуванням змісту умов цього Договору.
      </p>
      <p className={styles.text}>
        11. Згода на обробку та зберігання персональних даних є згодою
        користувача сайту та/або користувача чат-бота, при заповненні будь-якої
        заяви, запиту, форми чи іншим чином надання своїх особистих даних (повне
        ім'я, контактні номери телефонів, адреси електронної пошти та інші
        надані особисті дані) через чат-бот або сайт або, продовжуючи
        використовувати сайт або чат-бот, діючи вільно, за своєю власною волею
        та у своїх інтересах, а також підтверджуючи свою дієздатність та
        правоздатність, надати власнику сайту та/або його адміністратору згоду
        на:
      </p>
      <p className={styles.text}>
        збір, запис, обробку, накопичення, систематизацію, зберігання,
        уточнення, оновлення персональних даних, зокрема паспортних даних,
        персональних даних (вік, стать), інформації про зареєстроване або
        фактичне місце проживання, про реєстрацію фізичної особи у Державному
        реєстрі фізичних осіб - платників податків, ідентифікаційних даних в
        електронній формі (біографічні довідки, номери телефонів), запис
        зображень (фото) (на паперових носіях, на бланках картотек, в
        інформаційних (автоматизованих) системах і т.д., у тому числі в плані
        реєстрації та зберігання таких даних у переліку клієнтів), для
        реалізації прав та обов'язків, визначених чинним законодавством України
        та укладеними договорами/угоди; використання персональних даних, яке
        передбачає будь-які дії власника персональних даних для обробки таких
        даних, їх захист, а також дії щодо надання часткового чи повного права
        на обробку персональних даних іншим суб'єктам відносин; передача,
        розповсюдження персональних даних, що передбачає дії щодо передачі
        інформації про фізичну особу; доступ до персональних даних третіх осіб;
        отримання інформації з каналів зв'язку, включаючи рекламні повідомлення
        через SMS-повідомлення, месенджери, соціальні мережі чи адреси
        електронної пошти. Згода дається на обробку персональних даних про
        використання коштів автоматизації та діє весь час до моменту припинення
        або їх відгуку.
      </p>
      <p className={styles.text}>
        Згода набирає чинності з моменту її прийняття шляхом реєстрації на сайті
        та/або надання (розміщення) персональних даних на сайті.
      </p>
      <Subsubheading text="1. Акцептування Договору" />
      <p className={styles.text}>
        1.1. Підтвердженням акцептування Покупцем умов цього Договору є
        розміщення Покупцем на сайті https://golda-group.com на відповідний
        товар.
      </p>
      <p className={styles.text}>
        1.2. З моменту отримання Продавцем замовлення товару від Покупця
        вважається, що цей Договір укладено.
      </p>
      <p className={styles.text}>
        1.3. Здійснення Покупцем акцептування підтверджує, що Покупець
        ознайомився із змістом цього Договору, найменуванням Продавця, порядок
        прийняття претензій, з характеристиками товару, ціною товару, умовами
        оплати вартості товару, умовами доставки товару та оплатою вартості
        такої доставки, гарантійними зобов'язаннями на товар, порядком
        розірвання цього Договору, умови та зміст цього Договору повністю
        зрозумілі Покупцю, він не має жодних неузгоджених питань, тощо.
      </p>
      <Subsubheading text="2. Предмет Договору" />
      <p className={styles.text}>
        2.1. Продавець зобов'язується передати у власність замовлений їм товар,
        який є в наявності, а Покупець зобов'язується сплатити та прийняти
        замовлений товар на сайті.
      </p>
      <p className={styles.text}>
        2.2. Кількість та повна назва товару визначатиметься на підставі
        замовлення Покупця та вказуються у накладній.
      </p>
      <p className={styles.text}>
        2.3. Сторони відповідно до цього Договору підтверджують, що укладання
        цього Договору здійснюється на основі вільного волевиявлення кожної із
        Сторін та при повному розумінні предмета та умов цього Договору.
      </p>
      <p className={styles.text}>
        2.4.Укладенням цього Договору, Покупець підтверджує, що він знайомий з
        інформацією про умови постачання та строки оплати вартості постачання
        товару, проданого за умовами цього Договору, а також з інформацією про
        сам товар, а саме про його форму, розміри, зовнішній вигляд, дизайн,
        кольорі, розмірі, його якості, характеристиках матеріалу, з якого
        вироблений товар, та з інформацією про його виробника, усвідомлює такі
        характеристики товару та їх значення, та згоден на придбання такого
        товару із такими характеристиками.
      </p>
      <p className={styles.text}>
        2.5. Покупець зобов'язується не вчиняти дискримінаційних дій,
        недобросовісну конкуренцію, неправомірне використання ділової репутації
        Продавця та/або щодо Продавця (або у разі позначення товару належним
        Продавцю) знаком для товарів та послуг та/або як промислового зразка
        (далі – ТМ) та щодо власника / правовласника такої ТМ).
      </p>
      <p className={styles.text}>
        2.6. Покупець зобов'язується не копіювати, не модифікувати та не
        використовувати у своїй діяльності ТМ, якою зазначено товар з цього
        Договору.
      </p>
      <Subsubheading text="3. Термін та умови доставки товару, умови прийому-передачі товарів" />
      <p className={styles.text}>
        3.1. Термін, протягом якого Продавець зобов'язаний доставити Покупцеві
        замовлений ним товар, передбачений замовленням на сайті, становить до 7
        робочих днів, а у разі замовлення товару вартістю до 500 грн. з дати
        оплати Покупцем вартості транспортних витрат / вартості доставки на
        умовах, та за тарифами тощо. відповідної служби доставки (наприклад,
        Нова пошта, Делівері, Міст-Експрес тощо).
      </p>
      <p className={styles.text}>
        3.2. Сторони домовилися, що Продавець має право не братися до виконання
        умов цього Договору у разі несплати Покупцем певних у ньому платежів, у
        т.ч., але не виключно, у випадках несплати вартості транспортних витрат
        з доставки Покупцю товару в певне останнє місце, або не оплати вартості
        товару на умовах, передбачених цим Договором.
      </p>
      <p className={styles.text}>
        3.3. Права власності на товар, а також ризик його загибелі пошкодження
        переходить від Продавця до Покупця з моменту прийняття товару Покупцем
        або перевізником відповідно до накладної чи іншого документа,
        встановленого перевізником, що підтверджує отримання товару Покупцем чи
        перевізником. Ризик випадкового псування чи втрати товару, що
        поставляється, переходить від Продавця до Покупця разом з виникненням у
        останнього права власності такий товар.
      </p>
      <p className={styles.text}>
        3.4. Продавець зобов'язаний поставити товар у кількості, асортименті,
        згідно з накладною на підставі замовлення Покупця, сформованого в його
        особистому кабінеті на сайті, а Покупець зобов'язаний сплатити товар.
      </p>
      <p className={styles.text}>
        3.5. Доставка товару відбувається на розсуд Покупця або його силами або
        силами третіх осіб, які надають послуги з перевезення товару
        (перевізником). Сторони встановили, що Покупець має право самостійно
        визначати перевізника товару за погодженням із Покупцем.
      </p>
      <p className={styles.text}>
        3.5.1. Доставка товару відбувається силами перевізника за рахунок
        Покупця за адресою, вказаною Покупцем у замовленні на товар (далі за
        текстом – місце доставки товару).
      </p>
      <p className={styles.text}>
        3.5.2. Замовлення доставки товару у перевізника, вказаного на сайті,
        здійснює Продавець на підставі інформації замовлення Покупця.
      </p>
      <p className={styles.text}>
        3.5.3. З вартістю послуги доставки відповідного товару Покупець може
        ознайомитись на сайті відповідного перевізника.
      </p>
      <p className={styles.text}>
        3.5.4. У разі безпідставного неприйняття Покупцем товару, доставленого
        (направленого) Продавцем (перевізником) Покупцю або у разі повернення
        товару Покупцем Продавцю, за винятком випадків повернення
        неякісного/некомплектного/невідповідного асортименту товару Продавець
        має право: - не повертати Покупцю сплачені кошти як відшкодування
        транспортних витрат /вартість доставки при замовленні товару вартість до
        500 грн./; - при повернення коштів, сплачених Покупцем за такий товар,
        утримати суму понесених витрат, які є транспортні витрати / вартість
        доставки такого товару.
      </p>
      <p className={styles.text}>
        3.5.5. Покупець підтверджує свою згоду з умовами п.3.5. цього Договору.
      </p>
      <p className={styles.text}>
        3.6. Про орієнтовну дату доставки перевізником товару Покупцеві
        Продавець з урахуванням інформації перевізника повідомляє Покупця за
        допомогою телефонного зв'язку за номером телефону Покупця, зазначеним у
        замовленні на товар. Покупець зобов'язаний забезпечити свою присутність
        чи присутність третіх осіб, які могли б здійснити ухвалення товару, за
        місцем його доставки у встановлену Продавцем (перевізником) дату.
        Покупець зобов'язаний прийняти товар за місцем його доставки.
      </p>
      <p className={styles.text}>
        У разі отримання Покупцем за визначеним місцем доставки товару такий
        товар зберігається на умовах, визначених перевізником, причому вартість
        кожного дня зберігання товару протягом строку, який починається після
        закінчення терміну передачі товару, встановленого п.3.1. цього Договору,
        встановлюється перевізником та складає суму, що визначається за кожен
        день зберігання. Покупець зобов'язаний сплатити вартість такого
        зберігання на користь такого перевізника за весь термін зберігання
        такого товару.
      </p>
      <p className={styles.text}>
        Якщо товар не був прийнятий (вивезений) Покупцем протягом 7 календарних
        днів після закінчення строку передачі товару, встановленого п.3.1. цього
        Договору, Продавець має право розпорядитися таким товаром на свій розсуд
        без повернення Покупцю вартості такого товару. Повторна доставка товару
        Покупцю здійснюється силами та за рахунок Покупця зі складу Продавця
        (або перевізника), адреса якого повідомляється Продавцем на запит
        Покупця додатково.
      </p>
      <p className={styles.text}>
        Продавець має право за своєю згодою здійснити повторне постачання товару
        Покупцю за місцем доставки товару за рахунок Покупця.
      </p>
      <p className={styles.text}>
        3.7. Сторони домовилися, що у разі відсутності Покупця за місцем
        доставки товару, передача товару може бути здійснена іншій особі (третій
        особі), яка знаходиться за місцем доставки товару, та яка має при собі і
        пред'явив документ, що підтверджує висновок цього Договору (договір
        та/або квитанція про сплату вартості товару та/або інше) між Сторонами
        або оформлення доставки товару.
      </p>
      <p className={styles.text}>
        3.8. При прийомі-передачі товару Покупець (або третя особа) зобов'язаний
        перевірити асортимент, кількість доставленого товару на відповідність
        замовлення Покупця та накладної на відповідний товар, а також
        комплектацію товару та наявність видимих ​​недоліків товару.
      </p>
      <p className={styles.text}>
        У разі підписання Покупцем (або третьою особою) накладної / декларації /
        іншого документа, що підтверджує фактичне прийняття товару Покупцем (або
        третьою особою) від перевізника, Покупець (або третя особа) також є
        таким підписанням у тому числі підтверджує відсутність претензій щодо
        асортименту, якості та комплектності одержаного товару.
      </p>
      <p className={styles.text}>
        3.9. Прийом-передача товару за асортиментом та кількістю здійснюється в
        відповідно до замовлення Покупця, прийом-передача товару за якістю
        здійснюється відповідно до нормативно-правових актів та нормативними
        документами, дія яких поширюється на товар, що є предметом цього
        Договору, а також відповідно до умов цього Договору.
      </p>
      <p className={styles.text}>
        3.10. Продавець зобов'язаний надати Покупцю (або третій особі з сторони
        Покупця) документи на товар, які зазвичай потрібні.
      </p>
      <p className={styles.text}>
        Накладна на товар та/або інші супровідні документи можуть бути
        засвідчені електронним підписом та печаткою (за її наявності) Продавця,
        та надаються Продавцем Покупцеві шляхом її/їх направлення в особистий
        кабінет Покупця.
      </p>
      <p className={styles.text}>
        3.11. У разі доставки товару перевізником, відповідальність за
        збереження товару досі його передачі Покупцеві несе перевізник.
      </p>
      <p className={styles.text}>
        3.12. Перед замовленням товару та його придбанням Продавець реєструє для
        Покупця особистий кабінет.
      </p>
      <Subsubheading
        text="4. Якість товару, гарантійний термін товару, умови та порядок
        врегулювання питань невідповідності товару умовам договору"
      />
      <p className={styles.text}>
        4.1. Якість товару має відповідати ГОСТ, ТУ (нормативно-правовим актам
        та/або нормативним документам) або вимогам Продавця.
      </p>
      <p className={styles.text}>
        4.2. Продавець гарантує доставити та передати Покупцеві якісний товар та
        відповідний державним стандартам (у разі їх встановлення для такого
        виду). Гарантія якості товару поширюється на все комплектуючі (складові)
        частини товару, якщо такі мають місце.
      </p>
      <p className={styles.text}>
        4.3. Гарантійний термін товару вказується у гарантійному талоні на
        товар. Гарантійний термін починає дію з підписання Покупцем накладних на
        відповідний товар чи інші терміни, передбачені чинним законодавством
        України.
      </p>
      <p className={styles.text}>
        4.4. Умови гарантійного терміну та терміну служби товару поширюються на
        товар, щодо якого Покупцем було пред'явлено такі документи без винятку:
      </p>
      <p className={styles.text}>- Гарантійний талон на відповідний товар;</p>
      <p className={styles.text}>- накладна на товар;</p>
      <p className={styles.text}>
        - Квитанцію, що підтверджує сплату покупцем вартості товару.
      </p>
      <p className={styles.text}>
        4.5. Умови гарантійного терміну товару та терміну служби товару не
        поширюються на товар, ремонт (усунення недоліків) якого здійснюється
        самостійно Покупцем чи третіми особами. Умови гарантійного терміну
        товару та терміну служби товару не поширюються на товар, умови
        експлуатації та/або транспортування та/або збереження якого було
        порушено Покупцем.
      </p>
      <p className={styles.text}>
        4.6. Продавець не несе відповідальності за використання товару на
        призначення товару.
      </p>
      <p className={styles.text}>
        4.7. Претензій щодо кількості та/або асортименту та/або якості (щодо
        видимих ​​недоліків товару), та/або комплектності товару Покупець
        зобов'язаний пред'явити Продавцю на момент прийому-передачі товару
        Покупцю у т.ч. за допомогою телефонного зв'язку, якщо доставка товару
        здійснювалася перевізником. Шляхом укладання цього Договору Сторони
        цього Договору встановили, що зазначений строк на пред'явлення Покупцем
        Продавцю претензій за кількістю та/або асортиментом та / або якості
        (щодо видимих ​​недоліків товару), та/або некомплектність товару є
        розумним.
      </p>
      <p className={styles.text}>
        4.8. Після завершення прийому-передачі товару Покупцю він не може
        пред'являти претензії Продавцю за кількістю товару та/або асортименту
        товару та/або неналежного комплектації товару та/або недоліків товару,
        які могли бути виявлені Покупцем під час приймання-передачі товару.
      </p>
      <p className={styles.text}>
        4.9. Претензії щодо прихованих недоліків товару, недоліків, допущених
        виробником товару і які не могли бути виявлені Покупцем у момент
        прийому-передачі товару від Продавця Покупцю, можуть бути пред'явлені
        Покупцем на адресу Продавця протягом усього гарантійного строку, що
        поширюється на товар, що постачається за умовами цього Договору.
      </p>
      <p className={styles.text}>
        4.10. У разі виявлення Покупцем недоліків товару у момент його
        прийому-передачі, Покупець зобов'язаний відразу, до залишення Продавцем
        (представником Продавця, перевізником) місця доставки товару та до
        моменту підписання Покупцем супровідних документів на товар, повідомити
        про це Продавця.
      </p>
      <p className={styles.text}>
        У разі прийняття Сторонами рішення про повернення товару щодо якого
        виникли питання щодо якості, продавця, Покупець повинен негайно, до
        моменту залишення Продавцем або перевізником місця доставки товару,
        передати Продавцю чи перевізнику такий товар з метою вивчення Продавцем
        характеру, причини появи нестачі товару, аналізу питання можливого
        усунення нестачі товару та здійснення інших дій, спрямованих на
        врегулювання виниклих претензій з сторони Покупця. При цьому Продавець
        чи перевізник (за довіреністю продавця) зобов'язаний надати Покупцеві
        документ, що підтверджує повернення Покупцем Продавцю такого товару
        (наприклад, але не виключно – акт про повернення товару).
      </p>
      <p className={styles.text}>
        4.11. Сторони домовилися, що якщо товар, який був доставлений Продавцем
        Покупцю не є укомплектованим належним чином Отже, Продавець зобов'язаний
        доукомплектувати товар протягом 20 (двадцяти) календарних днів з дати
        отримання відповідної претензії від Покупця.
      </p>
      <p className={styles.text}>
        4.12. Сторони домовилися, що якщо товар, доставлений Покупцеві має
        недоліки, Продавець зобов'язаний усунути такі недоліки товару протягом
        30 (тридцяти) календарних днів із дати отримання відповідної претензії
        від Покупця та отримання неякісного товару, якщо повернення товару
        Продавцю передбачається характером встановленого нестачі товару.
      </p>
      <p className={styles.text}>
        4.13. Сторони встановили, що строк та порядок заміни неякісного товару
        регулюються Законом України «Про захист прав споживачів» та здійснюється
        негайно або у двомісячний строк у разі відсутності товару у магазині чи
        складі Продавца.
      </p>
      <p className={styles.text}>
        4.14. Шляхом укладання цього Договору Сторони за ним домовилися та
        встановили, що терміни усунення недоліків та до-укомплектування товару
        відповідно до п.4.11. та п,4.12. цього Договору є розумними враховуючи
        необхідний час перевезення товару, вивчення характеру недоліків, часу,
        необхідного для усунення недоліків товару, часу, необхідного для
        доставки товару Покупцю після усунення недоліків, часу, необхідного для
        до-укомплектації товару та часу, необхідного для здійснення інших дій,
        пов'язаних з приведенням товару у відповідність до вимог цього Договору.
      </p>
      <p className={styles.text}>
        4.15. Сторони цього Договору домовилися, що при виникненні розбіжностей
        щодо наявності недоліків товару чи причин виникнення таких недоліків,
        Продавець має право здійснити огляд товару за місцем доставки товару або
        запропонувати здійснити Покупцем повернення товару, щодо якого у Покупця
        є претензії щодо його якості.
      </p>
      <p className={styles.text}>
        4.16. Порядок задоволення обґрунтованої претензії Покупця здійснюються
        за згодою Сторін цього Договору, якщо інше встановлено умовами цього
        Договору чи обов'язковість певних дій не передбачено чинним
        законодавством України.
      </p>
      <p className={styles.text}>
        4.17. Сторони встановили, що Покупець не має права на повернення товару,
        що відповідає вимогам цього Договору, замовлення на сайті, а саме за
        кількістю, асортиментом, комплектністю та який був доставлений Покупцю
        відповідно до умов цього Договору та замовлення на сайті.
      </p>
      <Subsubheading text="5. Умови та порядок розрахунків між Сторонами" />
      <p className={styles.text}>
        5.1. Розрахунки між Сторонами за умовами цього Договору здійснюються в
        національну валюту України шляхом перерахування Покупцем відповідної
        грошової суми на рахунок Продавця відповідно до банківськими
        реквізитами, вказаними на сайті (або сформованому замовлення).
      </p>
      <p className={styles.text}>
        5.2. Датою оплати Покупцем вартості товару вважається дата надходження
        відповідної суми коштів на рахунок Продавця.
      </p>
      <p className={styles.text}>
        5.3. Розрахунок за замовлений Покупцем товар може бути здійснений
        Покупцем на таких умовах:
      </p>
      <p className={styles.text}>
        - шляхом здійснення повної 100% (стовідсоткової) передоплати вартості
        замовленого товару протягом 3 (трьох) банківських днів з дати
        виставлення Продавцем Покупцеві відповідного рахунку або надання
        Продавцем Покупцеві іншого документа (повідомлення), яке включає все
        реквізити, необхідних здійснення оплати вартості товару;
      </p>
      <p className={styles.text}>або</p>
      <p className={styles.text}>
        - шляхом здійснення передоплати у погодженому Сторонами розмірі вартості
        замовленого товару протягом 3 (трьох) банківських днів із дати
        виставлення Продавцем Покупцеві відповідного рахунку або надання
        Продавцем Покупцю іншого документа (повідомлення), яке включає всі
        реквізити, необхідні для здійснення оплати вартості товару. При цьому
        остаточний розрахунок за товар Покупець зобов'язаний здійснити у день
        одержання відповідного товару.
      </p>
      <p className={styles.text}>
        5.4. Вартість доставки товару, у разі доставки товару Покупцю з
        допомогою послуг перевізника, Покупець зобов'язаний здійснити одночасно
        оплатою вартості товару згідно з п.5.3. цього Договору.
      </p>
      <Subsubheading text="6. Права та обов'язки Сторін Договору" />
      <p className={styles.text}>6.1. Обов'язки Продавця:</p>
      <p className={styles.text}>
        6.1.1. Здійснити постачання товару дотримуючись умов цього Договору.
      </p>
      <p className={styles.text}>6.2. Права продавця:</p>
      <p className={styles.text}>
        6.2.1. Вимагати від Покупця прийняття товару, який поставлено відповідно
        до умов цього Договору та замовлення Покупця, зробленого їм на сайті.
      </p>
      <p className={styles.text}>
        6.2.2. Вимагати від Покупця виконання та дотримання умов цього Договору
        належним чином та у встановлені терміни.
      </p>
      <p className={styles.text}>
        6.2.3. Відмовити Покупцеві у продажу товару, якого немає в наявності
        Продавця.
      </p>
      <p className={styles.text}>6.3. Обов'язки Покупця:</p>
      <p className={styles.text}>
        6.3.1. Прийняти чи забезпечити прийом товару у Продавця чи перевізника
        дотримуючись умов цього Договору.
      </p>
      <p className={styles.text}>
        6.3.2. Дотримуватись умов Договору та виконувати обов'язки, які прямо
        передбачені умовами цього Договору або такі, що випливають з умов цього
        Договору.
      </p>
      <p className={styles.text}>6.4. Права Покупця:</p>
      <p className={styles.text}>
        6.4.1. Вимагати від Продавця доставки та передачі товару відповідно до
        умовами цього Договору.
      </p>
      <p className={styles.text}>
        6.4.2. Вимагати від Продавця виконання та дотримання умов цього Договору
        належним чином та у встановлені терміни.
      </p>
      <Subsubheading
        text="7. Відповідальність Сторін Договору та порядок розгляду та
        врегулювання суперечок"
      />
      <p className={styles.text}>
        7.1. У разі невиконання або неналежного виконання будь-якої із Сторін
        обов'язкових умов цього Договору така Сторона несе відповідальність
        відповідно до чинного законодавства України.
      </p>
      <p className={styles.text}>
        7.2. Сторони цього Договору домовилися, що будь-які суперечки, які
        можуть виникнути між ними під час дії цього Договору, можуть
        вирішуватись шляхом пред'явлення однією Стороною за цим Договором іншою
        Стороні відповідної претензії, викладеної письмово або будь-яким іншим
        способом, передбаченим умовами цього Договору.
      </p>
      <p className={styles.text}>
        Розгляд претензій здійснюється протягом 20 (двадцятьох) календарних днів
        з дати отримання претензії Стороною, на адресу якої така претензія була
        направлена, якщо інше не встановлено умовами цього Договору.
      </p>
      <p className={styles.text}>
        У разі не досягнення Сторонами згоди щодо спору, такий суперечка та
        розбіжності вирішуються відповідно до чинного законодавством України.
      </p>
      <p className={styles.text}>
        7.3. Продавець звільняється від відповідальності за порушення
        (невиконання, неналежне виконання, прострочення виконання) умов цього
        Договору, якщо таке порушення обумовлено дією форс-мажорних обставин
        (обставин непереборної сили), що виникли після укладання цього Договору.
      </p>
      <Subsubheading text="8. Строк дії Договору" />
      <p className={styles.text}>
        8.1. Цей Договір набирає чинності з моменту його акцепту Покупцем та діє
        до моменту виконання Продавцем та Покупцем зобов'язань, передбачених
        умовами цього Договору.
      </p>
      <Subsubheading text=" 9. Зміна умов Договору та його розірвання" />
      <p className={styles.text}>
        9.1. Умови цього Договору можуть бути змінені або доповнені шляхом
        розміщення їх на сайті.
      </p>
      <p className={styles.text}>
        9.2. Сторони домовилися, що цей Договір може бути достроково розірвано в
        односторонньому порядку будь-якої із Сторін. Договір вважається
        розірваним у день отримання Стороною-одержувачем повідомлення про
        розірвання цього Договору повідомлення від іншої Сторони щодо цього
        Договору у т.ч. письмового, але не винятково.
      </p>
      <p className={styles.text}>
        9.3. Сторони домовилися, що у разі розірвання цього Договору щодо
        ініціативу Покупця або відмову Покупця від доставки йому товару,
        вказаного у замовленні, після оплати його вартості Продавець має право
        не повертати Покупцеві сплачені ним кошти чи має право повернути такі
        кошти частково у розмірі не більше 0,1% від загальної вартості товару,
        який було замовлено Покупцем. Продавець має право повернути кошти
        Покупцеві у будь-якому іншому розмірі, якщо на те є взаємна згода Сторін
        щодо цього Договору.
      </p>
      <p className={styles.text}>
        9.4. У разі розірвання цього Договору з ініціативи Продавця чи у разі
        безпідставної відмови продавця від виконання умов цього Договору,
        Покупець має право вимагати від продавця компенсації в розмірі вартості
        товару відповідно до замовлення Покупця, якому Продавцем не було
        виконано зобов'язань. Покупець має право вимагати компенсації від
        продавця у будь-якому іншому розмірі, якщо на те є взаємна згода сторін
        за цим Договором.
      </p>
      <Subsubheading text="10. Персональні дані" />
      <p className={styles.text}>
        10.1. Сторони дають добровільну згоду на обробку своїх персональних
        даних в обсязі, що містяться в цьому Договорі, замовлення на сайті,
        рахунках, акти, накладні та інші документи, що стосуються виконання
        цього Договору.
      </p>
      <p className={styles.text}>
        Приєднання до Договору означає однозначну згоду з вищевикладеним та
        підтвердженням того, що уповноважена особа кожної із Сторін ознайомлено
        із змістом ст. 8 Закону України «Про захист персональних даних» та метою
        обробки персональних даних (не є загальнодоступними):
      </p>
      <p className={styles.text}>обслуговування запитів, заявок;</p>
      <p className={styles.text}>підтримка зв'язку з користувачем;</p>
      <p className={styles.text}>
        передача інформації у тому числі рекламної (повідомлень) через чат бот
        або на вказаний користувачем e-mail, номер телефону, поштову адресу та
        т.д., у тому числі шляхом відправлення рекламних, сервісних та новинних
        розсилок;
      </p>
      <p className={styles.text}>надання послуг;</p>
      <p className={styles.text}>продажу товарів;</p>
      <p className={styles.text}>
        укладання договору з користувачем або клієнтом та його виконання;
      </p>
      <p className={styles.text}>
        встановлення зворотного зв'язку, включаючи направлення повідомлень,
        запитів, що стосуються використання сайту або чат-бота, надання послуг,
        обробка запитів та заявок;
      </p>
      <p className={styles.text}>визначення місця знаходження користувача;</p>
      <p className={styles.text}>
        IP адреси, з якої було виконано вхід на сайт;
      </p>
      <p className={styles.text}>інформація з cookies;</p>
      <p className={styles.text}>
        інформація про браузер (або іншу програму, яка здійснює доступ до
        сайту);
      </p>
      <p className={styles.text}>час доступу до сайту;</p>
      <p className={styles.text}>відвіданих адрес сторінок,</p>
      <p className={styles.text}>реферер (адреса попередньої сторінки).</p>
      <p className={styles.text}>
        10.2. Сторони гарантують, що будь-які персональні дані, що передаються в
        відповідно до умов цього Договору, отримані, обробляються та передаються
        відповідно до вимог чинного законодавства України у сфері захисту
        персональних даних
      </p>
      <p className={styles.text}>
        Сторони гарантують, що передача та обробка отриманих персональних даних
        здійснюється з метою забезпечення виконання зобов'язань щодо цього
        Договору, в обсязі та в межах, визначених Законом України «Про захист
        персональних даних».
      </p>
      <p className={styles.text}>
        Спосіб обробки персональних даних - обробка персональних даних з
        використанням автоматизованої інформаційної системи.
      </p>
      <p className={styles.text}>
        10.3. Покупець зобов'язується у разі зміни персональних даних надавати у
        найкоротші терміни уточнену, достовірну інформацію та відповідні
        документи для їхнього оновлення. Покупцеві відомі права суб'єкта
        персональних даних, визначених Законом України «Про захист персональних
        даних», власника персональних даних, склад та зміст персональних даних,
        що збираються, мета збору таких даних і право передати персональні дані.
      </p>
      <p className={styles.text}>
        10.4. У разі порушення однієї із Сторін вимог законодавства про захист
        персональних даних, інша Сторона не несе відповідальності за таке
        порушення.
      </p>
      <p className={styles.text}>
        Власник сайту та/або його адміністратор не несе жодної відповідальності
        за розголошення третім особам персональних даних у разі, якщо таке
        розголошення необхідне для реалізації ним своїх прав та обов'язків,
        визначених чинним законодавством України та ув'язненими договорами.
      </p>
      <Subsubheading text="11. Інші умови Договору" />
      <p className={styles.text}>
        11.1. Цей Договір є обов'язковим до виконання його Сторонами.
      </p>
      <p className={styles.text}>
        11.2. Сторони встановили, що визнання цього Договору є недійсним у
        будь-якій його окремій частині не є підставою для визнання недійсним
        цього Договору у повному обсязі.
      </p>
      <p className={styles.text}>
        11.3. Шляхом укладання цього Договору Покупець надає Продавцю згоду на
        обробку та зберігання своїх персональних даних з метою реалізації
        відносин, що виникають між Сторонами на підставі цього Договору, з метою
        забезпечення реалізації адміністративно-правових відносин, податкових
        відносин, відносин у сфері бухгалтерського обліку, відносин у сфері
        реклами, збору персональних даних у комерційних цілях, відносин у сфері
        статистики відповідно до чинного законодавством України.
      </p>
      <p className={styles.text}>
        Укладаючи цей Договір, Покупець підтверджує, що попереджено (знаком) із
        своїми правами, передбаченими ст.8 Закону України «Про захист
        персональних даних».
      </p>
      <p className={styles.text}>
        11.4. Сторони гарантують, що на момент укладання цього Договору вони
        наділені відповідними повноваженнями та мають право на укладання цього
        Договору.
      </p>
      <p className={styles.text}>
        11.5. З усіх питань, які не передбачені умовами цього Договори, Сторони
        керуються чинним законодавством України.
      </p>
    </section>
  );
}

export default ContacrtOffer;

export function Subheading({
  text,
  customStyle,
}: {
  text: string;
  customStyle?: { [key: string]: string };
}) {
  return (
    <h4 style={customStyle} className={styles.subheading}>
      {text}
    </h4>
  );
}

export function Subsubheading({
  text,
  customStyle,
}: {
  text: string;
  customStyle?: { [key: string]: string };
}) {
  return (
    <h5 style={customStyle} className={styles.subsubheading}>
      {text}
    </h5>
  );
}
