// eslint-disable-next-line no-restricted-imports
import styles from "./contract-offer.module.scss";

function ContacrtOffer() {
  return (
    <>
      <p className={styles.text}>
        ПУБЛІЧНИЙ ДОГОВІР КУПІВЛІ-ПРОДАЖУ ТОВАРУ Терміни, які використовуються у
        даному Публічному договорі купівлі-продажу товару 1. Публічний договір
        купівлі-продажу товару (надалі – «Договір») - договір в якому Продавець
        взяв на себе обов'язок здійснити продаж товару/ів, кожній особі, яка до
        нього звернеться (Покупцю). 2. Продавець – фізична особа-підприємець,
        яка розміщує на сайті інформацію про товари, які вона реалізує/продає.
        Продавцем може бути будь-яка особа, якій було надано правовласником таке
        право продажу товару. Найменування Продавця вказується в документах на
        передачу товару (накладній) Покупцю. 3. Покупець – особа (чи фізична чи
        підприємець чи юридична), яка придбаває, замовляє, використовує або має
        намір придбати чи замовити товар. 4. Оферта – пропозиція Продавця в
        адресу будь-якої особи щодо укладання даного Договору. 5. Акцепт –
        надання особою (Покупцем) повної та безумовної згоди щодо укладання
        даного Договору на умовах, викладених у даному Договорі. 6. Товар –
        товари, асортимент, ціна та характеристики яких зазначені на сайті
        Продавця. 7. Доставка товару – дії Сторони даного Договору, які
        призводять до прибуття товару за місцем його доставки. 8. Місце доставки
        товару – адреса, за якою здійснюється доставка товару за даним
        Договором. 9. Приймання-передача товару – дії Сторін даного Договору
        (або третьої особи з боку Покупця), які призводять до фактичної передачі
        товару від однієї Сторони Договору іншій, та оформлюються підписанням
        Сторонами накладної або іншого документу, який свідчить про передачу
        товару однією Стороною даного Договору чи перевізником іншій Стороні
        даного Договору. 10. Сторона (Сторони) за даним Договором – Продавець
        або Покупець (Продавець та Покупець) враховуючи зміст умов Договору. 11.
        Згода на обробку та зберігання персональних даних – це згода користувача
        сайту та/або користувач чат-боту, при заповненні будь-якої заявки,
        запиту, форми або наданні будь яким іншим способом своїх персональних
        даних (прізвище ім’я по батькові; номери контактних телефонів; адреси
        електронної пошти та інші надані персональні дані) через чат-бот або
        сайт або продовжуючи використання сайту або чат-боту, діючи вільно,
        своєю волею і в своїх інтересах, а також підтверджуючи свою дієздатність
        та правоздатність, надати власнику сайту та/чи його адміністратору,
        згоду на: збір, запис, обробку, накопичення, систематизація, зберігання,
        уточнення, оновлення персональних даних зокрема паспортних даних,
        особистих відомостей (вік, стать), відомостей про зареєстроване або
        фактичне місце проживання, щодо реєстрації фізичної особи у Державному
        реєстрі фізичних осіб - платників податків, ідентифікаційних даних в
        електронному вигляді (біографічні довідки, номери телефонів), запису
        зображення (фото) (на паперових носіях, на бланках картотек, в
        інформаційних (автоматизованих) системах тощо, у тому числі в частині
        реєстрації та зберігання таких даних в переліку клієнтів) для реалізації
        прав та обов’язків, визначених чинним законодавством України та
        укладеними договорами/правочинами; використання персональних даних, що
        передбачає будь-які дії володільця персональних даних з обробки таких
        даних, їх захисту, а також дії з надання часткового або повного права
        обробки персональних даних іншим суб’єктам відносин; передача, поширення
        персональних даних, що передбачає дії з передачі відомостей про фізичну
        особу; доступ до персональних даних третіх осіб; отримання інформації по
        каналах зв’язку, у тому числі рекламних повідомлень за допомогою
        смс-повідомлень, месенджерів, соціальних мереж або електронних адрес.
        Згода дається на обробку персональних даних з використання засобів
        автоматизації і діє весь час до моменту припинення обробки персональних
        даних чи відкликання її. Згода вступає в силу з моменту її прийняття
        шляхом реєстрації на сайті та/чи надання (розміщення) персональних даних
        на сайті. 1. Акцептування Договору 1.1. Підтвердженням здійснення
        Покупцем акцептування умов даного Договору є розміщення Покупцем на
        сайті https://camotec.ua/shop замовлення на відповідний товар. 1.2. З
        моменту отримання Продавцем від Покупця замовлення на товар даний
        Договір вважається укладеним. 1.3. Здійснення Покупцем акцептування
        підтверджує те, що Покупець ознайомився зі змістом даного Договору,
        найменуванням Продавця, порядком прийняття претензій, з характеристиками
        товару, з ціною товару, умовами оплати вартості товару, умовами доставки
        товару та оплати вартості такої доставки, гарантійними зобов’язаннями
        щодо товару, порядком розірвання даного Договору, умови і зміст даного
        Договору повністю є зрозумілими для Покупця, у нього відсутні будь-які
        неузгоджені питання, тощо. 2. Предмет Договору 2.1. Продавець
        зобов'язується передати у власність Покупцю замовлений ним товар, який є
        в наявності, а Покупець зобов'язується оплатити та прийняти замовлений
        товар на сайті. 2.2. Кількість і повне найменування Товару, остаточно
        будуть визначені на підставі замовлення Покупця та вказані в накладних.
        2.3. Сторони за даним Договором підтверджують, що укладання даного
        Договору здійснюється на підставі вільного волевиявлення кожної зі
        Сторін та при повному розумінні предмету та умов даного Договору. 2.4.
        Укладенням даного Договору Покупець підтверджує, що він ознайомлений із
        інформацією про умови доставки і умови оплати вартості доставки товару,
        який продається за умовами даного Договору, а також із інформацією про
        сам товар, а саме стосовно його форми, габаритів, зовнішнього вигляду,
        дизайну, кольору, розміру, його якість, характеристиками матеріалу, з
        якого товар вироблено та з інформацією стосовно його виробника,
        усвідомлює такі характеристики товару та їх значення та згодний на
        придбання такого товару із такими характеристиками. 2.5. Покупець бере
        на себе зобов’язання не здійснювати дискримінаційних дій, недобросовісну
        конкуренцію, неправомірне використання ділової репутації Продавця та/чи
        відносно Продавця (або у випадку позначення товару належним Продавцю)
        знаком для товарів та послуг і/або промисловим зразком (далі – ТМ) й
        відносно власника / правоволодільця такої ТМ). 2.6. Покупець
        зобов’язується не копіювати, не модифікувати та не використовувати в
        своїй діяльності ТМ, якою позначений товар за даним Договором. 3. Строк
        та умови доставки товару, умови приймання-передачі товару 3.1. Строк
        протягом якого Продавець зобов’язаний доставити Покупцеві замовлений ним
        товар, передбачений замовленням на сайті, становить до 7 робочих днів, а
        у випадку замовлення товару вартістю до 500 грн. з дати оплати Покупцем
        вартості транспортних витрат / вартість доставки відповідно до умов, та
        за тарифами, тощо відповідної служби доставки (наприклад, Нова пошта,
        Делівері, Міст-Експрес, і т.д.). 3.2. Сторони дійшли згоди, що Продавець
        має право не приступати до виконання умов даного Договору у випадку
        несплати Покупцем визначених у ньому платежів, у т.ч. але не виключно у
        випадках не сплати вартості транспортних витрат з доставки Покупцю
        товару у визначене останнім місце, чи не сплати вартості товару на
        умовах, передбачених даним Договором. 3.3. Права власності на товар, а
        також ризик його загибелі чи пошкодження переходить від Продавця до
        Покупця з моменту прийняття товару Покупцем чи перевізником відповідно
        до накладної чи іншого документу, встановленого перевізником, що
        підтверджує отримання товару Покупцем чи перевізником. Ризик випадкового
        псування або втрати товару, що постачається, переходить від Продавця до
        Покупця разом із виникненням у останнього права власності на такий
        товар. 3.4. Продавець зобов’язаний поставити товар у кількості,
        асортименті, згідно накладної на підставі замовлення Покупця
        сформованого в його особистому кабінеті на сайті, а Покупець
        зобов’язаний оплатити товар. 3.5. Доставка товару відбувається на розсуд
        Покупця або його силами або силами третіх осіб, які надають послуги
        перевезення товару (перевізником). Сторони встановили, що Покупець має
        право самостійно визначати перевізника товару за погодження із Покупцем.
        3.5.1. Доставка товару відбувається силами перевізника за рахунок
        Покупця за адресою, вказаною Покупцем у замовленні на товар (надалі за
        текстом – місце доставки товару). 3.5.2. Замовлення доставки товару у
        перевізника зазначеного на сайті здійснює Продавець на підставі
        замовлення Покупця. 3.5.3. З вартістю послуги доставки відповідного
        товару Покупець може ознайомитися на сайті відповідного перевізника.
        3.5.4. У випадку безпідставного неприйняття Покупцем товару доставленого
        (направленого) Продавцем (перевізником) Покупцю або у випадку повернення
        товару Покупцем Продавцю, за виключенням випадків повернення неякісного
        / некомплектного / невідповідаючого асортименту товару, Продавець має
        право: - не повертати Покупцю сплачені грошові кошти в якості
        відшкодування транспортних витрат /вартість доставки при замовленні
        товару вартість до 500 грн./; - при поверненні грошових коштів,
        сплачених Покупцем за такий товар, утримати суму понесених витрат, які
        представляють собою транспортні витрати / вартість доставки такого
        товару Покупцю. 3.5.5. Покупець підтверджує й свою згоду з умовами
        п.3.5. даного Договору. 3.6. Про орієнтовну дату доставки перевізником
        товару Покупцю Продавець з урахуванням інформації перевізника повідомляє
        Покупця за допомогою телефонного зв’язку за номером телефону Покупця,
        вказаним у замовленні на товар. Покупець зобов’язаний забезпечити власну
        присутність або присутність третіх осіб, які б могли здійснити прийняття
        товару за місцем його доставки та у визначену Продавцем (перевізником)
        дату. Покупець зобов’язаний прийняти товар за місцем його доставки. У
        випадку не отримання Покупцем за визначеним ним місцем доставки товару
        такий товар зберігається на умовах, визначених перевізником, при цьому
        вартість кожного дня зберігання товару, протягом строку, який
        починається після спливу строку передачі товару, встановленого п.3.1.
        даного Договору, встановлюється перевізником і становить суму, яка
        визначається за кожен день зберігання. Покупець зобов’язаний сплатити
        вартість такого зберігання на користь такого перевізника за весь строк
        зберігання такого товару. У випадку якщо товар не був прийнятий
        (вивезений) Покупцем протягом 7 календарних днів після спливу строку
        передачі товару, встановленого пунктом 3.1. даного Договору, Продавець
        має право розпорядитися таким товаром на власний розсуд без повернення
        Покупцю вартості такого товару. Повторна доставка товару Покупцю
        здійснюється силами та за рахунок Покупця зі складу Продавця (або
        перевізника), адреса якого повідомляється Продавцем за запитом Покупця
        додатково. Продавець має право за власної згоди здійснити повторну
        поставку товару Покупцю за місцем доставки товару за рахунок Покупця.
        3.7. Сторони дійшли згоди, що у випадку відсутності Покупця за місцем
        доставки товару, передача товару може бути здійснена іншій особі (третій
        особі), яка знаходиться за місцем доставки товару, та яка має при собі
        та пред’явила документ, який підтверджує укладання даного Договору
        (договір та/або квитанція про сплату вартості товару, та/або інше) між
        його Сторонами або оформлення доставки товару. 3.8. При
        прийманні-передачі товару Покупець (або третя особа) зобов’язана
        перевірити асортимент, кількість доставленого товару на відповідність
        замовленню Покупця та накладній на відповідний товар, а також
        комплектацію товару та наявність видимих недоліків товару. У випадку
        підписання Покупцем (або третьою особою) накладної/ декларації/ іншого
        документу, яка/ий підтверджує фактичне прийняття товару Покупцем (або
        третьою особою) від перевізника, Покупець (або третя особа) також таким
        підписанням підтверджує відсутність претензій щодо асортименту, якості
        та комплектності отриманого товару. 3.9. Приймання-передача товару за
        асортиментом та кількістю здійснюється відповідно до замовлення Покупця,
        приймання-передача товару за якістю здійснюється відповідно до
        нормативно-правових актів і нормативних документів, дія яких
        розповсюджується на товар, який є предметом даного Договору, а також
        відповідно до умов даного Договору. 3.10. Продавець зобов’язаний надати
        Покупцеві (або третій особі з боку Покупця) документи на товар, що
        звичайно вимагаються. Накладна на товар та/або інші супровідні документи
        можуть бути завірені електронним підписом та печаткою (за наявності
        такої) Продавця, та надаються Продавцем Покупцю шляхом її / їх
        надіслання в особистий кабінет Покупця. 3.11. У випадку доставки товару
        перевізником, відповідальність за збереження товару до моменту його
        передачі Покупцю несе перевізник. 3.12. Перед замовленням товару та його
        придбанням Продавець реєструє для Покупця особистий кабінет. 4. Якість
        товару, гарантійний строк товару, умови та порядок врегулювання питань
        щодо невідповідності товару умовам Договору 4.1. Якість товару повинна
        відповідати ДСТУ, ТУ (нормативно-правовим актам і/або нормативним
        документам) або вимогам Продавця. 4.2. Продавець гарантує доставити та
        передати Покупцю якісний товар та такий, що відповідає державним
        стандартам ( у разі їх встановлення для такого виду). Гарантія якості
        товару поширюється на всі комплектуючі (складові) частини товару, якщо
        такі мають місце. 4.3. Гарантійний строк товару вказується у
        гарантійному талоні на товар. Гарантійний строк починає дію з моменту
        підписання Покупцем накладних на відповідний товар або в інші строки,
        передбачені чинним законодавством України. 4.4. Умови гарантійного
        строку та строку служби товару розповсюджуються на товар, відносно якого
        Покупцем було пред’явлено такі документи без виключення: - гарантійний
        талон на відповідний товар; - накладна на товар; - квитанцію, яка
        підтверджує сплату Покупцем вартості товару. 4.5. Умови гарантійного
        строку товару та строку служби товару не розповсюджуються на товар,
        ремонт (усунення недоліків) якого здійснюється самостійно Покупцем або
        третіми особами. Умови гарантійного строку товару та строку служби
        товару не розповсюджуються на товар, умови експлуатації та/або
        транспортуванням, та/або збереження якого були порушені Покупцем. 4.6.
        Продавець не несе відповідальність за використання товару на за
        призначенням товару. 4.7. Претензію щодо кількості та/або асортименту,
        та/або якості (стосовно видимих недоліків товару), та/або
        некомплектності товару Покупець зобов’язаний пред’явити Продавцю в
        момент приймання-передачі товару від Продавця Покупцю у т.ч. за
        допомогою телефонного зв’язку, якщо доставка товару здійснювалася
        перевізником. Шляхом укладання даного Договору Сторони за даним
        Договором встановили, що вказаний строк на пред’явлення Покупцем
        Продавцю претензій щодо кількості та/або асортименту, та/або якості
        (стосовно видимих недоліків товару), та/або комплектності товару є
        розумним. 4.8. Після завершення приймання-передачі товару Покупцем він
        не може пред’являти претензії Продавцю щодо кількості товару та/або
        асортименту товару, та/або неналежної комплектації товару, та/або
        недоліків товару, які могли бути виявлені Покупцем під час
        приймання-передачі товару. 4.9. Претензії щодо прихованих недоліків
        товару, недоліків, які були допущені виробником товару та не могли бути
        виявлені Покупцем в момент приймання-передачі товару Покупцем, можуть
        бути пред’явлені Покупцем в адресу Продавця протягом всього гарантійного
        строку, який розповсюджується на товар, поставляємий за умовами даного
        Договору. 4.10. У випадку виявлення Покупцем недоліків товару в момент
        його приймання-передачі, Покупець зобов’язаний одразу, до залишення
        Продавцем (представником Продавця, перевізником) місця доставки товару
        та до моменту підписання Покупцем супроводжувальних документів на товар,
        повідомити про це Продавця. У разі прийняття Сторонами рішення щодо
        повернення товару Продавцю, відносно якого виникли питання по якості,
        Покупець повинен негайно, до моменту залишення Продавцем або
        перевізником місця доставки товару, передати Продавцю або перевізнику
        такий товар з метою вивчення Продавцем характеру, причини появи недоліку
        товару, аналізу питання можливого усунення недоліку товару та вчинення
        інших дій, направлених на врегулювання виниклих претензій з боку
        Покупця. При цьому Продавець або перевізник (за дорученням Продавця)
        зобов’язаний надати Покупцеві документ, якій підтверджує повернення
        Покупцем Продавцю такого товару (наприклад, але не виключно – Акт про
        повернення товару). 4.11. Сторони дійшли згоди, що у випадку якщо товар,
        який був доставлений Покупцю не є укомплектованим належним чином,
        Продавець зобов’язаний здійснити до-укомплектацію товару протягом 20
        (двадцяти) календарних днів з дати отримання відповідної претензії від
        Покупця. 4.12. Сторони дійшли згоди, що у випадку якщо товар,
        доставлений Покупцю, має недоліки, Продавець зобов’язаний усунути такі
        недоліки товару протягом 30 (тридцяти) календарних днів з дати отримання
        відповідної претензії від Покупця та отримання неякісного товару, якщо
        повернення товару Продавцю передбачається характером встановленого
        недоліку товару. 4.13. Сторони встановили, що строк та порядок заміни
        неякісного товару регулюються Законом України «Про захист прав
        споживачів» та здійснюється негайно або у двомісячний строк у випадку
        відсутності товару в магазині чи на складі Продавця. 4.14. Шляхом
        укладання даного Договору Сторони за даним Договором дійшли згоди та
        встановили, що строки усунення недоліків та доукомплектування товару
        згідно п.4.11. та п.4.12. даного Договору являються розумними враховуючи
        необхідний час на перевезення товару, вивчення характеру недоліків,
        часу, необхідного для усунення недоліків товару, часу, необхідного для
        доставки товару Покупцеві після усунення недоліків, часу, необхідного
        для до-укомплектації товару та часу, необхідного для вчинення інших дій,
        пов'язаних із приведенням товару у відповідність до вимог даного
        Договору. 4.15. Сторони за даним Договором дійшли згоди, що при
        виникненні розбіжностей щодо наявності недоліків товару або причин
        виникнення таких недоліків, Продавець має право здійснити огляд товару
        за місцем доставки такого товару або запропонувати здійснити Покупцем
        повернення товару, відносно якого у Покупця існують претензії щодо його
        якості. 4.16. Порядок задоволення обґрунтованої претензії Покупця
        здійснюються за згодою Сторін даного Договору, якщо інше не встановлено
        умовами даного Договору або обов’язковість певних дій не передбачена
        чинним законодавством України. 4.17. Сторони встановили, що Покупець не
        має права на повернення товару, який відповідає вимогам даного Договору,
        замовленню на сайті, а саме за кількістю, асортиментом, комплектністю та
        який був доставлений Покупцю відповідно до умов даного Договору. 5.
        Умови та порядок розрахунків між Сторонами 5.1. Розрахунки між Сторонами
        за умовами цього Договору здійснюються у національній валюті України
        шляхом перерахування Покупцем відповідної грошової суми на рахунок
        Продавця відповідно до банківських реквізитів, вказаних на сайті (чи
        сформованому замовленні). 5.2. Датою оплати Покупцем вартості товару
        вважається дата надходження відповідної суми грошових коштів на рахунок
        Продавця. 5.3. Розрахунок за замовлений Покупцем товар може бути
        здійснений Покупцем на наступних умовах: - шляхом здійснення повної 100%
        (сто відсоткової) передоплати вартості замовленого товару на протязі 3
        (трьох) банківських днів з дати виставлення Продавцем Покупцю
        відповідного рахунку або надання Продавцем Покупцю іншого документу
        (повідомлення), яке містить у собі всі реквізити, які необхідні для
        здійснення оплати вартості товару; або - шляхом здійснення передоплати у
        погодженому Сторонами розмірі від вартості замовленого товару на протязі
        3 (трьох) банківських днів з дати виставлення Продавцем Покупцю
        відповідного рахунку або надання Продавцем Покупцю іншого документу
        (повідомлення), яке містить у собі всі реквізити, які необхідні для
        здійснення оплати вартості товару. При цьому остаточний розрахунок за
        товар Покупець зобов’язаний здійснити у день отримання відповідного
        товару. 5.4. Вартість доставки товару, у випадку доставки товару Покупцю
        за допомогою послуг перевізника, Покупець зобов’язаний здійснити
        одночасно із оплатою вартості товару згідно з п.5.3. даного Договору. 6.
        Права та обов’язки Сторін Договору 6.1. Обов’язки Продавця: 6.1.1.
        Здійснити поставку товару дотримуючись умов даного Договору. 6.2. Права
        Продавця: 6.2.1. Вимагати від Покупця прийняття товару, який поставлений
        у відповідності до умов даного Договору і замовлення Покупця,
        здійсненого ним на сайті. 6.2.2. Вимагати від Покупця виконання та
        дотримання умов даного Договору належним чином та у встановлені строки.
        6.2.3. Відмовити Покупцеві у продажу товару, якого не має у наявності у
        Продавця. 6.3. Обов’язки Покупця: 6.3.1. Прийняти або забезпечити
        приймання товару у Продавця або перевізника дотримуючись умов даного
        Договору. 6.3.2. Додержуватися умов даного Договору та виконувати
        обов’язки, які прямо передбачені умовами даного Договору чи випливають з
        умов даного Договору. 6.4. Права Покупця: 6.4.1. Вимагати від Продавця
        доставки та передачі товару у відповідності до умов даного Договору.
        6.4.2. Вимагати від Продавця виконання та дотримання умов даного
        Договору належним чином та у встановлені строки. 7. Відповідальність
        Сторін Договору та порядок розгляду та врегулювання спорів 7.1. У
        випадку невиконання або неналежного виконання будь-якою зі Сторін
        обов’язкових умов даного Договору, така Сторона несе відповідальність
        відповідно до чинного законодавства України. 7.2. Сторони за даним
        Договором дійшли згоди, що будь-які спори, що можуть виникнути між ними
        під час дії даного Договору, можуть вирішуватися шляхом пред’явлення
        однією Стороною за даним Договором іншій Стороні за даним Договором
        відповідної претензії викладеної у письмовому вигляді або у будь-який
        інший спосіб, передбачений умовами даного Договору. Розгляд претензій
        здійснюється протягом 20 (двадцяти) календарних днів з дати отримання
        такої претензії Стороною, в адресу якої така претензія була направлена,
        якщо інше не встановлено умовами даного Договору. У випадку недосягнення
        Сторонами згоди щодо виниклого спору, такий спір та розбіжності
        вирішуються у відповідності до чинного законодавства України. 7.3.
        Продавець звільняється від відповідальності за порушення (невиконання,
        неналежне виконання, прострочення виконання) умов даного Договору, якщо
        таке порушення зумовлено дією форс-мажорних обставин (обставин
        непереборної сили), що виникли після укладення даного Договору. 8. Строк
        дії Договору 8.1. Даний Договір набирає чинності з моменту його
        акцептування Покупцем та діє до моменту виконання Продавцем та Покупцем
        зобов’язань, передбачених умовами даного Договору. 9. Зміна умов
        Договору та його розірвання 9.1. Умови даного Договору можуть бути
        змінені або доповнені шляхом розміщення їх на сайті. 9.2. Сторони дійшли
        згоди, що даний Договір може бути достроково розірваний в
        односторонньому порядку будь-якою зі Сторін. Договір вважається
        розірваним в день отримання Стороною-отримувачем повідомлення про
        розірвання даного Договору відповідного повідомлення від іншої Сторони
        за даним Договором у т.ч. письмового, але не виключно. 9.3. Сторони
        дійшли згоди, що у випадку розірвання даного Договору за ініціативою
        Покупця або відмови Покупця від доставки йому товару, зазначеного у
        замовленні, після оплати його вартості, Продавець має право не повертати
        Покупцеві сплачені ним грошові кошти або має право повернути такі
        грошові кошти частково у розмірі не більш 0,1 % від загальної вартості
        товару, який був замовлений Покупцем. Продавець має право повернути
        грошові кошти Покупцю у будь-якому іншому розмірі, якщо на те є взаємна
        згода Сторін за даним Договором. 9.4. У випадку розірвання даного
        Договору за ініціативою Продавця або у випадку безпідставної відмови
        Продавця від виконання умов даного Договору, Покупець має право вимагати
        від Продавця компенсації у розмірі вартості товару відповідно до
        замовлення Покупця, по якому Продавцем не було виконано зобов’язань.
        Покупець має право вимагати компенсації від Продавця у будь-якому іншому
        розмірі, якщо на те є взаємна згода Сторін за даним Договором. 10.
        Персональні дані 10.1. Сторони надають добровільну згоду на обробку
        власних персональних даних, в обсязі, що міститься у даному Договорі,
        замовленні на сайті, рахунках, актах, накладних, та інших документах, що
        стосуються виконання даного Договору. Приєднання до даного Договору
        означає однозначну згоду з вищевикладеним і підтвердженням того, що
        уповноважена особа кожної із Сторін ознайомлена зі змістом ст. 8 Закону
        України «Про захист персональних даних» та метою обробки персональних
        даних (не є загальнодоступними): обслуговування запитів, заявок;
        підтримки зв’язку з користувачем; надсилання інформації у тому числі
        рекламної (повідомлень) через чат-бот або на зазначений користувачем
        e-mail, номер телефону, поштову адресу, і т.д. в тому числі шляхом
        відправки рекламних, сервісних та новинних розсилок; надання послуг;
        продажу товарів; укладення договору і його виконання; встановлення
        зворотного зв’язку, включаючи напрямок повідомлень, запитів, що
        стосуються використання сайту або чат-боту, надання послуг, обробка
        запитів і заявок від користувача або клієнта; визначення місця
        знаходження користувача; IP адреси з якої був виконаний вхід на сайт;
        інформація з cookies; інформація про браузер (чи іншої програми, яка
        здійснює доступ до сайту); час доступу до сайту; відвіданих адрес
        сторінок; реферер (адреса попередньої сторінки). 10.2. Сторони
        гарантують, що будь-які персональні дані, що передаються відповідно до
        умов даного Договору, отримані, обробляються та передаються відповідно
        до вимог чинного законодавства України в сфері захисту персональних
        даних. Сторони гарантують, що передача та обробка отриманих персональних
        даних здійснюється виключно з метою забезпечення виконання зобов’язань
        за даним Договором, в обсязі і в межах, визначених Законом України «Про
        захист персональних даних». Спосіб обробки персональних даних - обробка
        персональних даних з використанням автоматизованої інформаційної
        системи. 10.3. Покупець зобов’язується у разі зміни персональних даних
        надавати у найкоротший строк уточнену, достовірну інформацію та
        відповідних документів для їх оновлення. Покупцеві відомі права суб’єкта
        персональних даних, визначені Законом України «Про захист персональних
        даних», володільця персональних даних, склад та зміст персональних
        даних, що збираються, мету збору таких даних та право передати
        персональні дані. 10.4. У разі порушення однією із Сторін вимог
        законодавства про захист персональних даних, інша Сторона не несе
        відповідальності за таке порушення. Власник сайту та/чи його
        адміністратор не несе будь-якої відповідальності за розголошення третім
        особам персональних даних у разі, якщо таке розголошення необхідне для
        реалізації ним своїх прав та обов’язків, визначених чинним
        законодавством України та укладеними договорами. 11. Інші умови Договору
        11.1. Договір є обов'язковим для виконання його Сторонами. 11.2. Сторони
        встановили, що визнання даного Договору недійсним у будь-якій його
        окремій частини не є підставою для визнання недійсним даного Договору у
        його повному обсязі. 11.3. Шляхом укладання даного Договору Покупець
        надає Продавцю згоду на обробку та зберігання своїх персональних даних з
        метою реалізації відносин, які виникають між Сторонами на підставі
        даного Договору, з метою забезпечення реалізації
        адміністративно-правових відносин, податкових відносин, відносин у сфері
        бухгалтерського обліку, відносин у сфері реклами, збору персональних
        даних з комерційною метою, відносин в сфері статистики у відповідності з
        діючим законодавством України. Укладаючи даний Договір Покупець
        підтверджує, що попереджений (ознайомлений) зі своїми правами,
        передбаченими ст.8 Закону України «Про захист персональних даних». 11.4.
        Сторони гарантують, що на момент укладання даного Договору вони наділені
        відповідними повноваженнями і мають право на укладання даного Договору.
        11.5. По всіх питаннях, які не передбачені умовами даного Договору,
        Сторони керуються чинним законодавством України.
      </p>
    </>
  );
}

export default ContacrtOffer;
